[
  {
    "title": "Introduction to istSOS4 and SensorThings API",
    "date": "2024-12-15",
    "time_range": "09:30-13:30",
    "location": "Room34-1102",
    "abstract": "istSOS (http://istsos.org) is a software that has been designed to support sensor data management, from collection to management and quality assessment to dissemination using OGC and ISO standard formats. Following the evolution of software libraries, hardware technologies and IoT wide adoption, istSOS has been reimplemented in its version 4: named “Things”. Taking its tradition of being a Python implementation OGC compliant it takes advantage of latest solutions to support the Sensor Things API (STA) specification.",
    "description": "Description of the workshop:\nistSOS (http://istsos.org) is a software that has been designed to support sensor data management, from collection to management and quality assessment to dissemination using OGC and ISO standard formats. Following the evolution of software libraries, hardware technologies and IoT wide adoption, istSOS has been reimplemented in its version 4: named “Things”. Taking its tradition of being a Python implementation OGC compliant it takes advantage of latest solutions to support the Sensor Things API (STA) specification. \nAt the end of the workshop participants will understand the principles of the istSOS4 and of the STA standard; will be able to setup an istSOS4 STA service and will learn how to interact with the service both as a consumer or producer, using supplementary interfaces or pure python code.",
    "speaker": "Massimiliano Cannata",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/SLWUBL/",
    "abstract_ja": "istSOS (http://istsos.org) は、センサーデータの収集から管理、品質評価、そしてOGCとISO標準フォーマットを使用した普及までをサポートするために設計されたソフトウェアです。ソフトウェアライブラリの進化、ハードウェア技術の進化、IoTの普及に伴い、istSOSはバージョン4（\"Things\"）で再実装されました。Python実装OGC準拠の伝統を受け継ぎ、Sensor Things API (STA)仕様をサポートする最新のソリューションを活用しています。",
    "description_ja": "ワークショップの説明\nistSOS (http://istsos.org)は、センサーデータの収集から管理、品質評価、そしてOGCやISO標準フォーマットを用いた普及までをサポートするために設計されたソフトウェアである。ソフトウェアライブラリの進化、ハードウェア技術の進化、IoTの普及に伴い、istSOSはバージョン4（\"Things\"）で再実装された。Python実装OGC準拠の伝統を受け継ぎ、Sensor Things API (STA)仕様をサポートする最新のソリューションを活用しています。\nワークショップの最後には、参加者はistSOS4とSTA標準の原理を理解し、istSOS4 STAサービスをセットアップすることができ、補助インターフェースまたは純粋なPythonコードを使用して、コンシューマまたはプロデューサとしてサービスと対話する方法を学ぶことができます。"
  },
  {
    "title": "An introduction to OGC API–Moving Features with pygeoapi and MobilityDB",
    "date": "2024-12-15",
    "time_range": "09:30-13:30",
    "location": "Room34-1101",
    "abstract": "Moving feature data can represent a variety of phenomena, including the movements of vehicles, people, animals, and even weather changes. A moving feature is conceptually a geographic feature with dynamic properties over time. This means that a data model can cover not only locations but also non-spatial attributes. The data model can also support dynamic relationships over time between moving features.",
    "description": "Workshop materials: https://github.com/opengeospatial/mf-swg/tree/main/workshop/FOSS4G_Asia_2024",
    "speaker": "Wijae Cho",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/8K83DU/",
    "abstract_ja": "移動特徴データは、車両、人、動物、さらには天候の変化など、さまざまな現象を表すことができる。移動特徴とは、概念的には、時間の経過とともに動的な特性を持つ地理的特徴である。これは、データモデルが位置だけでなく非空間属性もカバーできることを意味する。データ・モデルは、移動特徴間の時間的な動的関係もサポートできる。",
    "description_ja": "ワークショップ資料：https://github.com/opengeospatial/mf-swg/tree/main/workshop/FOSS4G_Asia_2024"
  },
  {
    "title": "Basic Python for Geospatial",
    "date": "2024-12-15",
    "time_range": "09:30-13:30",
    "location": "Room11-503",
    "abstract": "This workshop offers a comprehensive introduction to utilizing Python programming for geospatial analysis and visualization. Geospatial data is essential in various domains such as environmental sciences, urban planning, agriculture, and disaster management. This workshop aims to equip participants with foundational skills to harness the power of Python libraries and tools for handling, analyzing, and visualizing geospatial data.",
    "description": "The topics covered at the workshop are the following:\n1. Introduction to Python\n- Basics of Python syntax and data structures\n- Overview of key geospatial libraries\n2. Using Pandas for Data Wrangling\n- Reading and manipulating tabular data\n- Basic operations using Pandas\n3. Using GeoPandas for Vector Data\n- Analyzing vector data with GeoPandas\n4. Using Rasterio and GeoCube for Raster Data\n- Processing raster data with Rasterio\n- Basic interpolation using GeoCube",
    "speaker": "Feye Andal",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/77EBLF/",
    "abstract_ja": "このワークショップでは、地理空間分析と可視化のためのPythonプログラミングの活用を包括的に紹介します。地理空間データは、環境科学、都市計画、農業、災害管理など様々な分野で不可欠です。このワークショップでは、地理空間データを扱い、分析し、可視化するためのPythonライブラリやツールのパワーを活用するための基礎的なスキルを身につけることを目的としています。",
    "description_ja": "ワークショップで取り上げられるトピックは以下の通り：\n1.Python入門\n- Python構文とデータ構造の基礎\n- 主要な地理空間ライブラリの概要\n2.データ操作のためのPandasの使用\n- 表形式データの読み込みと操作\n- Pandasを使った基本操作\n3.GeoPandas を使ったベクトルデータの解析\n- GeoPandasを使ったベクトルデータの分析\n4.ラスターデータに対する Rasterio と GeoCube の使用\n- Rasterio によるラスターデータの処理\n- GeoCube を使用した基本的な補間"
  },
  {
    "title": "Build an Object Snap to a Geometric Location on Web Application",
    "date": "2024-12-15",
    "time_range": "09:30-13:30",
    "location": "Room11-504",
    "abstract": "Object snapping is a fundamental feature in Geographic Information Systems (GIS) that enhances the accuracy and efficiency of spatial data editing and analysis. This technique allows users to seamlessly align and connect geographic features, ensuring spatial relationships are maintained and data integrity is preserved. By snapping objects to predefined points, lines, or polygons, GIS professionals can create more precise maps and models, which is crucial for applications in urban planning, environmental management, and infrastructure development.",
    "description": "This workshop will guide you through the process of creating a web map application that enables users to drag points or objects on the map and snap them to specific geometries such as points, lines, or polygons. For instance, you may want to drag a point and have it snap onto a line, or if there is a polygon area where you want to place an object, you can write additional conditions to restrict the dragging of the object to only the specific areas where it can be placed.",
    "speaker": "Siriwat Suttipanyo",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/JKZGAW/",
    "abstract_ja": "オブジェクトスナップは、地理情報システム（GIS）の基本的な機能であり、空間データの編集と分析の精度と効率を高めます。このテクニックを使用すると、地理フィーチャをシームレスに整列させて接続できるため、空間的な関係が維持され、データの整合性が保たれます。オブジェクトをあらかじめ定義された点、線、または多角形にスナップすることで、GISの専門家はより正確な地図やモデルを作成することができます。",
    "description_ja": "このワークショップでは、ユーザーが地図上でポイントやオブジェクトをドラッグし、ポイント、ライン、ポリゴンなどの特定のジオメトリにスナップさせることができるウェブマップアプリケーションの作成プロセスをガイドします。例えば、点をドラッグして線にスナップさせたい場合や、オブジェクトを配置したいポリゴンエリアがある場合、オブジェクトのドラッグを配置可能な特定のエリアのみに制限する条件を追加で記述することができます。"
  },
  {
    "title": "Building a urban digital twin using open data, open source, and open standard,  a mago3D way!",
    "date": "2024-12-15",
    "time_range": "09:30-13:30",
    "location": "Room34-1104",
    "abstract": "In this workshop titled \"Building an Urban Digital Twin using Open Data, Open Source, Open Standards, a mago3D way!\", participants will embark on a hands-on journey to create a digital twin of a selected urban area in Thailand. Leveraging open data from Overture Maps and NASA's 30m resolution Digital Elevation Model (DEM), participants will learn how to integrate and process these datasets using open-source tools like mago3DTiler and visualize the final output in a Cesium-based 3D environment.",
    "description": "In the \"Building an Urban Digital Twin using Open Data, Open Source, Open Standards, a mago3D way!\" workshop, participants will explore how to create a detailed and interactive digital twin of an urban area in Thailand. The workshop will guide participants through the following steps:",
    "speaker": "Haneul Yoo",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/BZ7N7R/",
    "abstract_ja": "オープンデータ、オープンソース、オープンスタンダードを使ったmago3D流都市デジタルツインの構築！」と題されたこのワークショップで、参加者はタイの都市部のデジタルツインを作成する実践的な旅に出ます。Overture MapsのオープンデータとNASAの30m解像度のデジタル標高モデル（DEM）を活用し、参加者はmago3DTilerのようなオープンソースツールを使ってこれらのデータセットを統合し、処理する方法を学び、最終的なアウトプットをセシウムベースの3D環境で視覚化します。",
    "description_ja": "オープンデータ、オープンソース、オープンスタンダードを使用した、mago3D流の都市デジタルツインの構築！」ワークショップでは、参加者がタイの都市部の詳細でインタラクティブなデジタルツインを作成する方法を探ります。このワークショップでは、参加者を以下のステップに導きます："
  },
  {
    "title": "Developing a Web-Based Spatial Decision Support System (SDSS) Using Geoserver",
    "date": "2024-12-15",
    "time_range": "14:00-18:00",
    "location": "Room34-1101",
    "abstract": "This hands-on workshop delves into the creation of a web-based Spatial Decision Support System (SDSS) from the ground up, utilizing Geoserver as a key tool. SDSS development involves the integration of conventional and spatially referenced data, decision logic, and a web-based interface for spatial data analysis. The SDSS architecture comprises components such as Web Processing Service (WPS), Web Feature Service (WFS), Web Mapping Service (WMS), Geoserver/Map-server, and Geo-processing.",
    "description": "Use Case and Applications, Education and Training, Data Management and Visualization.\nPLEASE GO THROUGH ATTACHMENT FOR REQUIREMENTS AND DATA.",
    "speaker": "CHANDAN M C",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/KSDZBB/",
    "abstract_ja": "このハンズオンワークショップでは、Geoserverをキーツールとして、ウェブベースの空間意思決定支援システム（SDSS）を一から作成します。SDSSの開発には、従来のデータと空間参照データ、意思決定ロジック、空間データ分析のためのウェブベースのインターフェースの統合が含まれます。SDSSのアーキテクチャは、ウェブ処理サービス（WPS）、ウェブフィーチャーサービス（WFS）、ウェブマッピングサービス（WMS）、Geoserver/Map-server、Geo-processingなどのコンポーネントで構成されている。",
    "description_ja": "ユースケースとアプリケーション、教育とトレーニング、データ管理と可視化。\n要件とデータについては添付ファイルをご覧ください。"
  },
  {
    "title": "Battle of The Best Street-Level Imagery Collection Tool: A Workshop on KartaView and Mapillary using 360 cameras",
    "date": "2024-12-15",
    "time_range": "14:00-18:00",
    "location": "Room11-503",
    "abstract": "As the world increasingly goes digital, real-world information becomes accessible online, enabling virtual visits to locations through street-level imagery. This imagery is invaluable for capturing daily life and sharing local perspectives, making it useful for finding attractions or services remotely. Liminal spaces, which might seem trivial, can offer crucial insights for those in need of specific information. Our interactive workshop will introduce participants to KartaView and Mapillary, covering how to access and contribute to these platforms while having fun through demonstrations using GoPro 360 cameras. Open to all, this four-hour session includes a playful scavenger hunt, turning learning into an adventure as participants hone their skills in capturing and sharing street-level imagery.",
    "description": "As the world increasingly goes digital, real-world information becomes accessible online, enabling virtual visits to locations through street-level imagery. This imagery is invaluable for capturing daily life and sharing local perspectives, making it useful for finding attractions or services remotely. Liminal spaces, which might seem trivial, can offer crucial insights for those in need of specific information. Our interactive workshop will introduce participants to KartaView and Mapillary, covering how to access and contribute to these platforms while having fun through demonstrations using GoPro 360 cameras. Open to all, this four-hour session includes a playful scavenger hunt, turning learning into an adventure as participants hone their skills in capturing and sharing street-level imagery.",
    "speaker": "Janica Kylle De Guzman",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/VKXSFU/",
    "abstract_ja": "世界のデジタル化が進むにつれ、現実世界の情報がオンラインでアクセスできるようになり、街角の画像を通じてバーチャルな場所への訪問が可能になった。このような画像は、日常生活を撮影し、地域の視点を共有する上で非常に貴重であり、遠隔地から観光スポットやサービスを探すのに役立つ。些細に見える限界空間は、特定の情報を必要とする人々にとって重要な洞察を提供することができる。このインタラクティブなワークショップでは、参加者にKartaViewとMapillaryを紹介し、GoPro 360カメラを使ったデモンストレーションを楽しみながら、これらのプラットフォームへのアクセス方法と貢献の仕方について説明する。誰でも参加できるこの4時間のセッションには、遊び心のある借り物競争も含まれており、参加者はストリートレベルの画像をキャプチャして共有するスキルを磨きながら、学びを冒険に変えます。",
    "description_ja": "世界のデジタル化が進むにつれ、現実世界の情報がオンラインでアクセスできるようになり、街角の画像を通じてバーチャルな場所への訪問が可能になった。このような画像は、日常生活を撮影し、地域の視点を共有する上で非常に貴重であり、遠隔地から観光スポットやサービスを探すのに役立つ。些細に見える限界空間は、特定の情報を必要とする人々にとって重要な洞察を提供することができる。このインタラクティブなワークショップでは、参加者にKartaViewとMapillaryを紹介し、GoPro 360カメラを使ったデモンストレーションを楽しみながら、これらのプラットフォームへのアクセス方法と貢献の仕方について説明する。誰でも参加できるこの4時間のセッションには、遊び心のある借り物競争も含まれており、参加者はストリートレベルの画像をキャプチャして共有するスキルを磨きながら、学びを冒険に変えます。"
  },
  {
    "title": "ZOO-Project - OGC API - Processes - Introduction",
    "date": "2024-12-15",
    "time_range": "14:00-18:00",
    "location": "Room34-1102",
    "abstract": "The ZOO-Project will first be presented, along with details about the OGC API - Processes part 1: core. The participants will then learn how to set up the ZOO Kernel and to get an OGC API - Processes server running in a few simple steps. Some basic services will be presented to the attendees to give them the capability to reuse them later in their own application. Then, they will learn how to develop simple service using the Python language, through simple programming exercises. A ready to use client will be used to interact with the available OGC API - Processes services and the one to be developed. Participants will finally learn how to chain the existing services using the server-side Javascript ZOO-API.",
    "description": null,
    "speaker": "Gérald Fenoy",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/CG89CB/",
    "abstract_ja": "まず、ZOO-Projectについて、OGC API - Processes part 1: coreの詳細とともに紹介します。その後、ZOO Kernelのセットアップ方法と、OGC API - Processesサーバを簡単な手順で動作させる方法を学びます。いくつかの基本的なサービスを紹介し、参加者自身のアプリケーションで再利用できるようにします。その後、簡単なプログラミング演習を通して、Python言語を使用した簡単なサービスの開発方法を学びます。すぐに使えるクライアントを使用して、利用可能なOGC API - プロセスサービスと開発するサービス - と対話します。最後に、サーバサイドのJavascript ZOO-APIを使用して、既存のサービスを連鎖させる方法を学びます。"
  },
  {
    "title": "LLM (Large Language Model) geospatial python for geospatial analysis in GDAL native environment",
    "date": "2024-12-15",
    "time_range": "14:00-18:00",
    "location": "Room34-1104",
    "abstract": "We want to advance geospatial data science through first providing an optimal dev ops layer for anyone to build geospatial models/code in a GDAL native environment while being supported by co-pilot or GPT like Large Language Model that is trained/fine tuned on GDAL and geospatial python.",
    "description": "Spatial data science has come a long way since the great innovation of jupyter, followed by many packages such as xarray and rasterio built in python to allow integration and manipulation of many geospatial data formats such as geojson, geoparquet, geotiff and in more recent years zarr-type datacubes. And innovation never ceases to stop here. Due to the requirements of larger data workload and large computing power, many users today are moving to run geospatial python on the cloud. However, that is not a smooth transition. We see many things broken where data scientists struggled to put JupyterLab onto Amazon EC2 with GPU, and had to work with command line interface in order to install GDAL properly with python binding such that their geospatial python package would work.",
    "speaker": "Lawrence Xiao",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/C3BZLA/",
    "abstract_ja": "私たちは、GDALと地理空間Pythonで学習/微調整されたco-pilotやGPTのような大規模言語モデルによってサポートされながら、誰もがGDALネイティブ環境で地理空間モデル/コードを構築できる最適な開発運用レイヤーを提供することで、地理空間データサイエンスを発展させたいと考えています。",
    "description_ja": "空間データサイエンスは、jupyterの偉大な革新以来、長い道のりを歩んできた。その後、geojson、geoparquet、geotiff、そして近年ではzarrタイプのデータキューブなど、多くの地理空間データフォーマットの統合と操作を可能にする、pythonで構築されたxarrayやrasterioなどの多くのパッケージが登場した。そして、技術革新はここで止まることはない。より大きなデータワークロードと大きなコンピューティングパワーが要求されるため、今日、多くのユーザーがクラウド上で地理空間Pythonを実行するように移行している。しかし、それはスムーズな移行ではありません。データサイエンティストがJupyterLabをGPU搭載のAmazon EC2上に置くのに苦労したり、地理空間pythonパッケージが動作するようにpythonバインディングでGDALを適切にインストールするためにコマンドラインインターフェイスで作業しなければならなかったり、多くのことが壊れているのを私たちは目にする。"
  },
  {
    "title": "FOSS4G and Sustainable Development Goals in Asia and the Pacific",
    "date": "2024-12-16",
    "time_range": "09:45-10:15",
    "location": "Auditorium Hall 1",
    "abstract": "Large Language Models (LLMs) have revolutionized numerous aspects of modern life, demonstrating remarkable capabilities in language processing, code generation, and knowledge synthesis. Their potential extends to supporting the achievement of various Sustainable Development Goals (SDGs), offering innovative approaches to tackling complex global challenges. One promising application area is the mapping and monitoring phenomena measurable through Earth Observation (EO) data. It's estimated that around 40 of the 169 SDG targets and 30 of the 232 SDG indicators could benefit from the insights provided by the EO data analysis. The use of artificial intelligence (AI) for EO data analysis can further improve the number of SDG indicators that can be monitored with a higher accuracy and frequency.\nIn this context, research is underway to develop multimodal LLMs capable of directly processing EO data. However, these models are often computationally expensive to train, develop, and maintain, making them less feasible for low-capacity, high-risk countries that urgently need technological solutions for disaster mitigation. To address this challenge, we introduce SATGPT (accessible at satgpt.net), an innovative solution that leverages the current capabilities of LLMs and integrates them with cloud computing platforms and EO data. SATGPT represents a fully functional, innovative spatial decision support system designed for rapid deployment, particularly in resource-limited contexts.\nThis talk presents an instance of SATGPT configured for flood mapping, as an example. It simplifies the process with a user-friendly interface requiring only a prompt specifying flood duration and location. SATGPT leverages LLMs to generate GEE code dynamically, access historical databases, or perform unsupervised classification to detect flooded areas. This innovative integration of LLMs with GEE enhances the speed, accessibility, and real-time capabilities of flood mapping, making it more accessible to non-specialists and supporting resilient disaster management practices.\nFurthermore, to build the capacity to use these technologies effectively, the talk discusses the development of an online, free, and self-paced course titled \"Introduction to Geospatial Data Analysis with ChatGPT and Google Earth Engine.\" This course introduces participants to the fundamentals of ChatGPT and the Earth Engine Code Editor platform, empowering them to process and interpret geospatial data effectively outside the SATGPT. The innovative aspect of the course is developing the Geo-prompt engineering (GPE) concept, which focuses on using spatial, temporal, and satellite sensor- specific information in the prompt engineering process. The course aims to foster broader adoption of SATGPT and similar tools, equipping users with the knowledge and skills needed to leverage advanced technologies in disaster management. This talk is structured to provide a comprehensive overview of SATGPT and its contribution to enhancing flood mapping and disaster management in the Asia-Pacific region.",
    "description": "This talk explores the innovative use of Large Language Models (LLMs) in advancing Sustainable Development Goals (SDGs) through Earth Observation (EO) data. It introduces SATGPT, a cutting-edge spatial decision support system that combines LLMs with cloud computing to facilitate flood mapping and disaster management, particularly in resource-limited settings. SATGPT offers a user-friendly interface for generating Google Earth Engine (GEE) code and detecting flood areas with high accuracy. The presentation also covers the development of a free, self-paced online course, “Introduction to Geospatial Data Analysis with ChatGPT and Google Earth Engine,” which empowers users to harness these technologies for effective geospatial data analysis. This talk will highlight SATGPT’s impact on enhancing flood monitoring and building capacity for disaster management in the Asia-Pacific region.",
    "speaker": "Hamid Mehmood",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/Z8VFSK/",
    "abstract_ja": "大規模言語モデル（LLM）は、言語処理、コード生成、知識合成において卓越した能力を発揮し、現代生活の様々な側面に革命をもたらしている。その可能性は、様々な持続可能な開発目標（SDGs）の達成を支援し、複雑な地球規模の課題に取り組む革新的なアプローチを提供することにも及んでいる。有望な応用分野のひとつに、地球観測（EO）データを通じて測定可能な現象のマッピングとモニタリングがある。SDGsの169のターゲットのうち約40、SDGsの232の指標のうち約30が、EOデータ分析によってもたらされる洞察から恩恵を受ける可能性があると推定されている。EOデータ分析に人工知能（AI）を活用すれば、より高い精度と頻度で監視できるSDGs指標の数をさらに増やすことができる。\nこの観点から、EOデータを直接処理できるマルチモーダルLLMを開発する研究が進められている。しかし、これらのモデルは、訓練、開発、維持に計算コストがかかることが多く、災害軽減のための技術的ソリューションを緊急に必要としている、能力が低くリスクの高い国にとっては、実現可能性が低い。この課題に対処するため、LLMの現在の能力を活用し、クラウドコンピューティングプラットフォームやEOデータと統合した革新的なソリューションであるSATGPT（satgpt.netでアクセス可能）を紹介します。SATGPTは、特にリソースの限られた状況下での迅速な展開のために設計された、完全に機能する革新的な空間意思決定支援システムである。\n本講演では、例として洪水マッピング用に構成されたSATGPTのインスタンスを紹介する。SATGPTは、洪水の期間と場所を指定するプロンプトを表示するだけのユーザーフレンドリーなインターフェースで、プロセスを簡素化します。SATGPTはLLMを活用して、GEEコードを動的に生成したり、過去のデータベースにアクセスしたり、教師なし分類を実行して浸水地域を検出したりします。この革新的なLLMとGEEの統合により、洪水マッピングのスピード、アクセシビリティ、リアルタイム性が向上し、専門家以外でも利用しやすくなり、災害に強い防災の実践を支援します。\nさらに、これらの技術を効果的に使用する能力を構築するために、\"ChatGPTとGoogle Earth Engineを使用した地理空間データ解析入門 \"と題した、オンライン、無料、自習可能なコースの開発について説明する。このコースでは、ChatGPTとアースエンジン・コードエディタープラットフォームの基礎を紹介し、SATGPT以外でも地理空間データを効果的に処理・解釈できるようにする。このコースの革新的な側面は、空間的、時間的、衛星センサー固有の情報をプロンプト・エンジニアリング・プロセスで使用することに焦点を当てたジオ・プロンプト・エンジニアリング（GPE）のコンセプトを開発することです。このコースは、SATGPTや同様のツールの幅広い採用を促進し、災害管理における先進技術の活用に必要な知識とスキルをユーザーに提供することを目的としています。本講演では、SATGPTの包括的な概要と、アジア太平洋地域における洪水マッピングと災害管理の強化への貢献について説明します。",
    "description_ja": "本講演では、地球観測（EO）データを活用した持続可能な開発目標（SDGs）の推進における大規模言語モデル（LLM）の革新的な利用について探求する。LLMとクラウドコンピューティングを組み合わせた最先端の空間意思決定支援システムであるSATGPTを紹介し、特に資源が限られた環境における洪水マッピングと災害管理を促進する。SATGPTは、グーグルアースエンジン（GEE）コードを生成し、高精度で洪水地域を検出するためのユーザーフレンドリーなインターフェースを提供する。本講演では、これらの技術を効果的な地理空間データ解析に活用するための、無料の自習型オンラインコース「ChatGPTとGoogle Earth Engineによる地理空間データ解析入門」の開発についても取り上げます。本講演では、SATGPTがアジア太平洋地域の洪水モニタリングの強化や災害管理能力の構築に与える影響について紹介する。"
  },
  {
    "title": "Resilient and Regenerative City Development in Response to the Global Climate Crisis",
    "date": "2024-12-16",
    "time_range": "10:30-11:00",
    "location": "Auditorium Hall 1",
    "abstract": "The global climate crisis poses significant challenges, particularly for urban areas. Nebula, a specialist in resilient and regenerative city development, advocates for a paradigm shift towards creating \"happy future cities.\" Unlike traditional approaches that focus on rebuilding from scratch, Nebula emphasizes fostering an “environmentally enhancing, restorative relationship” with nature. This explores how cities can play a crucial role in addressing environmental challenges through strategic urban planning.",
    "description": "MQDC",
    "speaker": null,
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/STB3HV/",
    "abstract_ja": "世界的な気候危機は、特に都市部に大きな課題を突きつけている。レジリエントで再生可能な都市開発の専門家であるネビュラは、\"幸せな未来都市 \"の創造に向けたパラダイム・シフトを提唱している。ゼロからの再建に重点を置く従来のアプローチとは異なり、ネビュラは自然との「環境を強化し、修復する関係」を育むことを強調している。戦略的な都市計画を通じて、都市が環境問題に取り組む上でいかに重要な役割を果たせるかを探る。",
    "description_ja": "三菱総合研究所"
  },
  {
    "title": "Open or Perish",
    "date": "2024-12-16",
    "time_range": "11:00-11:30",
    "location": "Auditorium Hall 1",
    "abstract": "The research assessment is traditionally based on the evaluation of criteria such as the number of peer-reviewed publications, impact factor, and number or amount of grant funding. Unfortunately, this  approach has been proved to deeply influenced the way of conducting research that focus on quantity rather then quality and not . To maximize the impact of research as a practical mean to address societal challenges, a new approach, named Open Science, has been endorsed worldwide by major funding agencies over the last decade as the new research pathway.  Quality and impact, collaboration and sharing, diversity and equity, transparency and efficiency has become the new paradigms to be pursued.\nTo foster the adoption of the Open Science funding agencies are acting on two fronts: on one hand, by influencing policies and requiring the adoption of open science practices as a condition for funding access (Open Access, Open Data and Citizen Science), and on the other hand, by focusing on incentives and exploring new methods for evaluating scientific results.\nIt is clear that in the near future, the current “publish or perish” aphorism is shifting towards “open or perish” to describe the required work to succeed in an academic career. But how should a modern researcher act and comply with this new paradigm? It essential for her/him to understand the best practices that guarantee the recognition of her/his achievements by connecting the researcher, the publications, the software and the data. In this talk, an introduction of these best practices is addressed with the aim of sustain the Open Science adoption with particular reference to Open Software. Finally, new possible approaches envisioned for the evaluation of project proposals, career advancements and institutions assessment are presented and discussed.",
    "description": null,
    "speaker": "Cannata Massimiliano",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/MRVR7Q/",
    "abstract_ja": "研究評価は伝統的に、査読付き出版物の数、インパクト・ファクター、助成金の数や額といった基準に基づいて行われてきた。残念なことに、このアプローチは、質よりも量に重点を置く研究の進め方に深く影響していることが証明されている。社会的課題に取り組む現実的な手段として、研究のインパクトを最大化するために、オープンサイエンスと名付けられた新しいアプローチが、この10年間、主要な資金提供機関によって、新しい研究の道筋として世界中で支持されてきた。  質とインパクト、共同研究と共有、多様性と公平性、透明性と効率性は、追求すべき新しいパラダイムとなった。\n一方では、政策に影響を与え、資金提供の条件としてオープンサイエンスの実践（オープンアクセス、オープンデータ、シチズンサイエンス）の採用を要求することで、もう一方では、インセンティブに焦点を当て、科学的成果を評価する新しい方法を模索することである。\n近い将来、現在の「publish or perish」という格言が、アカデミックなキャリアで成功するために必要な仕事を表す「open or perish」へとシフトしていくことは明らかである。しかし、現代の研究者はどのように行動し、この新しいパラダイムに従うべきなのだろうか？研究者、出版物、ソフトウェア、そしてデータを結びつけることで、研究成果の認知を保証するベストプラクティスを理解することは、研究者にとって不可欠である。本講演では、特にオープン・ソフトウェアに言及しながら、オープン・サイエンスの採用を維持することを目的として、これらのベスト・プラクティスの紹介を行う。最後に、プロジェクト提案の評価、キャリアアップ、研究機関の評価について、新たな可能性のあるアプローチを提示し、議論する。"
  },
  {
    "title": "Thailand Dialogue on Open Data Governance, Privacy, and Legality",
    "date": "2024-12-16",
    "time_range": "11:30-12:00",
    "location": "Auditorium Hall 1",
    "abstract": "My presentation will explore the landscape of open data in Thailand, focusing on laws, regulations, policies, and the fundamental right to access information. It will assess how open data initiatives can foster transparency, innovation, and public engagement, while addressing challenges and proposing solutions. Special emphasis will be placed on how open data can play a crucial role in reducing inequality by empowering citizens with greater access to information, enabling more equitable participation in decision-making processes, and driving inclusive social development.",
    "description": null,
    "speaker": "Assist.Prof.Prapaporn Rojsiriruch",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/V97YML/",
    "abstract_ja": "私のプレゼンテーションでは、法律、規制、政策、情報への基本的なアクセス権に焦点を当てながら、タイにおけるオープンデータの状況を探ります。また、オープンデータの取り組みがどのように透明性、革新性、市民参画を促進することができるかを評価するとともに、課題に取り組み、解決策を提案します。特に、オープンデータが、情報へのアクセスを拡大することで市民に権限を与え、意思決定プロセスへのより公平な参加を可能にし、包括的な社会開発を推進することで、不平等を削減する上でいかに重要な役割を果たすことができるかに重点を置く。"
  },
  {
    "title": "The MAGDA Project: Integration of GNSS, Sentinel, Meteodrone, and In-Situ Observations for Weather Warnings and Irrigation Advisories in Agriculture",
    "date": "2024-12-16",
    "time_range": "14:30-14:45",
    "location": "Auditorium Hall 2",
    "abstract": "The Meteorological Assimilation from Galileo and Drones for Agriculture (MAGDA) project, funded by EUSPA in the framework of the Horizon Europe program, aims to develop a comprehensive toolchain for atmosphere monitoring, weather forecasting, and advisory services related to severe weather, irrigation, and crop monitoring. By integrating GNSS, Copernicus Sentinel, Meteodrone, ground-based weather radar, and in-situ weather and soil observations into open source weather and hydrological models, MAGDA seeks to provide valuable information to agricultural operators. Measured data, model results, and warnings/advisories are delivered to farmers through a dedicated dashboard or by interfacing with existing Farm Management Systems. The technical and methodological components developed within MAGDA will form the basis for services supporting agricultural operations.\nThe project is based on the concept that continuous monitoring, combined with advanced prediction models, is essential for effective resource management. As extreme weather events, such as droughts and heatwaves, become more frequent due to climate change, farmers need to leverage technology to mitigate disasters, conserve resources, and enhance productivity. A system that can automatically collect and process measurements of key parameters significantly reduces economic losses. When this data is presented clearly and usefully to end users, it can significantly enhance agricultural efficiency.\nMAGDA unites seven partners from seven European countries (Austria, France, Italy, Romania, Spain, The Netherlands, and Switzerland) and is inherently interdisciplinary, drawing on expertise from various sectors to develop a system tailored to agricultural meteorological and hydrological forecasts.\nThe selected demonstrator areas in Italy (Cuneo), France (Burgundy), and Romania (Braila) target different crops/cultures and allow for the gathering of different user needs and feedback through direct interactions with farmers. Deployment includes nine low-cost, dual-frequency GNSS stations, along with fifteen low-cost in-situ sensor stations, and three Meteobases to fly meteodrones.\nSevere weather cases were identified to test the open source WRF meteorological model's performance: in Italy, the focus was on rainfall events, while in France and Romania, hail events were prioritized. Water balance simulations were conducted to support an operational irrigation advisory service, using the open source SPHY hydrological model across the pilot areas in France, Italy, and Romania.\nAll data used in the MAGDA project are open for research applications, and the GNSS processing software utilized in this project leverages the goGPS open source software. The MAGDA dashboard for result visualization uses Leaflet as a web mapping tool and OpenStreetMap data as a background layer. The results presented here are derived from the currently ongoing MAGDA demonstrators, showcasing the project's impact on weather forecasting and water management for agricultural operations.",
    "description": "Authors: Eugenio Realini (1), Alexandru Dumitrescu (2), Damir Haskovic (3), Martina Lagasio (4), Julien Orensanz (5), Matthias Piot (6), Lisa Verschuren (7)",
    "speaker": "Eugenio Realini",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/QRECLA/",
    "abstract_ja": "ガリレオとドローンによる農業のための気象同化（Meteorological Assimilation from Galileo and Drones for Agriculture：MAGDA）プロジェクトは、ホライゾン・ヨーロッパ・プログラムの枠組みの中でEUSPAから資金提供を受けており、大気のモニタリング、気象予報、悪天候、灌漑、作物モニタリングに関連する助言サービスのための包括的なツールチェーンを開発することを目的としている。GNSS、Copernicus Sentinel、Meteodrone、地上気象レーダー、現場気象・土壌観測をオープンソースの気象・水文モデルに統合することで、MAGDAは農業経営者に価値ある情報を提供しようとしている。測定データ、モデル結果、警告・助言は、専用のダッシュボードを通じて、あるいは既存の農業管理システムとのインターフェイスによって、農家に配信される。MAGDA内で開発された技術的・方法論的構成要素は、農業経営を支援するサービスの基礎となる。\nこのプロジェクトは、高度な予測モデルと組み合わせた継続的モニタリングが効果的な資源管理に不可欠であるというコンセプトに基づいている。気候変動により干ばつや熱波などの異常気象が頻発する中、農家はテクノロジーを活用して災害を軽減し、資源を節約し、生産性を高める必要がある。主要パラメータの測定値を自動的に収集・処理できるシステムは、経済的損失を大幅に削減する。このデータがエンドユーザーに明確かつ有用に提示されれば、農業効率を大幅に向上させることができる。\nMAGDAは、欧州7カ国（オーストリア、フランス、イタリア、ルーマニア、スペイン、オランダ、スイス）の7つのパートナーを結び、本質的に学際的であり、農業気象・水文予報に合わせたシステムを開発するために、さまざまな分野の専門知識を活用している。\nイタリア（Cuneo）、フランス（Burgundy）、ルーマニア（Braila）の実証地域は、それぞれ異なる作物／栽培を対象としており、農民との直接的な交流を通じて、さまざまなユーザーのニーズやフィードバックを集めることができる。配備には、9つの低コストの2周波GNSSステーション、15の低コストの現場センサーステーション、メテオドローンを飛ばすための3つのメテオベースが含まれる。\nオープンソースのWRF気象モデルの性能をテストするため、悪天候のケースが特定された。イタリアでは降雨イベントに焦点が当てられ、フランスとルーマニアでは雹イベントが優先された。水収支シミュレーションは、フランス、イタリア、ルーマニアのパイロット地域全体で、オープンソースのSPHY水文モデルを使用して、運用中の灌漑アドバイザリーサービスをサポートするために実施された。\nMAGDAプロジェクトで使用されたデータはすべて研究用途のために公開されており、このプロジェクトで利用されたGNSS処理ソフトウェアはgoGPSオープンソースソフトウェアを活用している。結果を視覚化するためのMAGDAダッシュボードは、ウェブマッピングツールとしてLeafletを使用し、背景レイヤーとしてOpenStreetMapデータを使用している。ここで紹介する結果は、現在進行中のMAGDA実証実験から得られたものであり、このプロジェクトが農業の気象予測と水管理に与える影響を紹介している。",
    "description_ja": "著者：Eugenio Realini（1）、Alexandru Dumitrescu（2）、Damir Haskovic（3）、Martina Lagasio（4）、Julien Orensanz（5）、Matthias Piot（6）、Lisa Verschuren（7）"
  },
  {
    "title": "State of mago3DTiler, an Open Source Based OGC 3D Tiles Creator",
    "date": "2024-12-16",
    "time_range": "14:30-14:45",
    "location": "Auditorium Hall 1",
    "abstract": "In this session, I will introduce mago3DTiler (https://github.com/Gaia3D/mago-3d-tiler), an open-source OGC 3D Tiles creator that has gained global popularity thanks to its robust features, high performance, and user-friendly interface. Initially unveiled at FOSS4G-Asia 2023 in Seoul, mago3DTiler supports over ten different 3D data formats, including 3DS, OBJ, FBX, glTF, Collada DAE, BIM (IFC), LAS, LAZ, and SHP. One of its standout features is on-the-fly Coordinate Reference System (CRS) conversion during the 3D Tiles creation process. Additionally, it allows users to convert 2D data with height attributes into extruded 3D Tiles.",
    "description": null,
    "speaker": "Sanghee Shin",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/WCMYUM/",
    "abstract_ja": "本セッションでは、オープンソースのOGC 3Dタイル作成ツールmago3DTiler (https://github.com/Gaia3D/mago-3d-tiler)をご紹介します。mago3DTilerは、その堅牢な機能、高いパフォーマンス、ユーザーフレンドリーなインターフェースにより、世界的な人気を博しています。ソウルで開催されたFOSS4G-Asia 2023で初公開されたmago3DTilerは、3DS、OBJ、FBX、glTF、Collada DAE、BIM (IFC)、LAS、LAZ、SHPを含む10種類以上の3Dデータフォーマットをサポートしています。その際立った特徴の1つは、3Dタイルの作成プロセス中にオンザフライで座標参照系（CRS）を変換できることです。さらに、高さ属性を持つ2Dデータを押し出し3Dタイルに変換することができます。"
  },
  {
    "title": "Mysuru 2034: An Integrated Geoinformatics Approach for Real Estate Valuation and Urban Growth",
    "date": "2024-12-16",
    "time_range": "14:30-14:50",
    "location": "Room34-1102",
    "abstract": "Over recent years, Mysore, a district in Karnataka, India, has seen remarkable urban growth and infrastructural development, transforming its landscape significantly. This study examines how this urban expansion influences property values, using data from 2014 and 2024 to forecast property values for 2034 with a Random Forest regression model. We focus on 110 key locations, looking at factors such as closeness to the central business district, railway station, bus stand, and local amenities like schools and hospitals. By finding the strongest correlations between these elements, we establish a relationship between property values and these factors to predict future values.",
    "description": null,
    "speaker": "CHANDAN M C",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/RQFWXY/",
    "abstract_ja": "近年、インドのカルナータカ州にあるマイソールは、著しい都市成長とインフラ整備が進み、景観が大きく変化している。本研究では、2014年と2024年のデータを用いて、ランダムフォレスト回帰モデルを用いて2034年の不動産価値を予測し、この都市の拡大が不動産価値にどのような影響を与えるかを検証する。110の主要な立地に焦点を当て、中心業務地区、鉄道駅、バススタンド、学校や病院などの地域施設に近いといった要因に注目した。これらの要素間の最も強い相関関係を見つけることで、不動産価値とこれらの要素との関係を確立し、将来の価値を予測する。"
  },
  {
    "title": "The Challenges of Reproducibility for Research Based on Geodata Web Services",
    "date": "2024-12-16",
    "time_range": "14:30-14:50",
    "location": "Room34-1104",
    "abstract": "Modern research applies the Open Science approach that fosters the production and sharing of Open Data according to the FAIR (Findable, Accessible, Interoperable, Reusable) principles. In the geospatial context, this is generally achieved through the setup of OGC Web services that implement open standards satisfying the FAIR requirements.",
    "description": null,
    "speaker": "Massimiliano Cannata",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/3MXMU3/",
    "abstract_ja": "現代の研究は、FAIR（Findable、Accessible、Interoperable、Reusable）の原則に従ってオープンデータの作成と共有を促進するオープンサイエンスのアプローチを適用している。地理空間の文脈では、これは一般的にFAIR要件を満たすオープンスタンダードを実装するOGCウェブサービスのセットアップを通じて達成される。"
  },
  {
    "title": "EIA(Environmental Impact Assessment) combined with 3D opensource geospatial.",
    "date": "2024-12-16",
    "time_range": "14:45-15:00",
    "location": "Auditorium Hall 1",
    "abstract": "This talk presents a research case of an open source implementation of a task management system based on 3D spatial information web service to efficiently conduct and manage tasks in the field of environmental impact assessment (EIA), which combines very diverse specialties.",
    "description": "EIA(Environmental Impact Assessment) is a set of many fields that are highly specialized in nature and therefore always consumes a lot of human and time resources when performing related tasks. In addition, environmental impact assessment is inseparable from geographical and spatial context. Therefore, in this project, we studied the technology to build efficient work and management processes and implement user-friendly services by utilizing an open source-based 3D geospatial web service platform. In particular, this presentation will focus on the areas of noise, air pollution/odor, and damage caused by electromagnetic fields from power supply lines.",
    "speaker": "Hakjoon Kim",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/7A9ZYA/",
    "abstract_ja": "本講演では、非常に多様な専門性が組み合わされた環境影響評価(EIA)の分野において、タスクを効率的に実施・管理するために、3次元空間情報Webサービスをベースとしたタスク管理システムをオープンソースで実装した研究事例を紹介する。",
    "description_ja": "EIA（環境影響評価）は多くの分野の集合であり、その性質上、高度に専門化されているため、関連する作業を行う際には常に多くの人的・時間的資源を消費する。また、環境影響評価は地理的・空間的な背景と不可分である。そこで本プロジェクトでは、オープンソースベースの3D地理空間ウェブサービスプラットフォームを活用することで、効率的な作業・管理プロセスを構築し、ユーザーフレンドリーなサービスを実現する技術を研究した。特に、騒音、大気汚染・臭気、送電線による電磁波被害の分野に焦点をあてて発表する。"
  },
  {
    "title": "Vector tiles cartography for Asia",
    "date": "2024-12-16",
    "time_range": "14:45-15:00",
    "location": "Auditorium Hall 2",
    "abstract": "Vector tiles are changing the way we create maps. Client-side rendering offers endless possibilities to the cartographer and has introduced new map design tools and techniques. Let’s explore an innovative approach to modern cartography based on simplicity and a comprehensive vector tiles schema. Take a visual tour of vector tiles cartography, and learn how to possibly adapt the map design for an asian audience.",
    "description": "Vector tiles are changing the way we create maps. Client-side rendering offers endless possibilities to the cartographer and has introduced new map design tools and techniques. Let’s explore an innovative approach to modern cartography based on simplicity and a comprehensive vector tiles schema. Take a tour of vector tiles cartography basics and learn about the latest trends through visual examples.",
    "speaker": "Nicolas Bozon",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/FNGVGL/",
    "abstract_ja": "ベクタータイルは地図作成の方法を変えつつあります。クライアントサイドレンダリングはカートグラファーに無限の可能性を提供し、新しい地図デザインツールやテクニックを導入しました。シンプルさと包括的なベクタータイル・スキーマに基づいた、現代の地図製作への革新的なアプローチを探ってみましょう。ベクタータイル地図製作のビジュアルツアーに参加し、アジアの読者のために地図デザインをどのように適応させるかを学びましょう。",
    "description_ja": "ベクタータイルは地図作成の方法を変えつつあります。クライアントサイドレンダリングはカートグラファーに無限の可能性を提供し、新しい地図デザインツールやテクニックを導入しました。シンプルさと包括的なベクタータイル・スキーマに基づいた、最新の地図製作への革新的なアプローチを探ってみましょう。ベクタータイル地図製作の基本を学び、ビジュアルな例を通して最新のトレンドについて学びましょう。"
  },
  {
    "title": "Mapping land suitability for sugarcane crop with fuzzy AHP and multi-criteria evaluation",
    "date": "2024-12-16",
    "time_range": "14:50-15:10",
    "location": "Room34-1104",
    "abstract": "Mapping land suitability is a critical approach for identifying appropriate land use for site selection and land-use planning. However, climate change exacerbates water shortages and droughts, significantly affecting land suitability and resulting in decreased crop yields, especially for sugarcane. While land suitability is typically evaluated based on multiple criteria such as soil properties, topography, climate, and socioeconomic factors, it is essential to incorporate drought conditions into land suitability mapping to mitigate climate change influences on crop yields. Therefore, this study aimed to map sugarcane land suitability using fuzzy AHP and multi-criteria evaluation approaches in the Northeast region of Thailand.",
    "description": "The integration of fuzzy AHP and multi-criteria evaluation was employed to re-analyze the suitability of land for sugarcane cultivation, based on its capabilities. The ETDI was applied as a crucial factor in the sugarcane land suitability analysis with an average factor weighting of 0.66, determined by considering both soil and vegetation conditions. The distance from river was also considered with an average factor weighting of 0.34. The paper presented that the suitable areas for sugarcane (61,566 km2) were mostly found in the moderately suitable class (S2; 30,521 km2, 49.6%), followed by the marginally suitable class (S3; 22,208 km2, 36.0%) and the highly suitable class (S1; 6,872 km2, 11.2%). In addition, the actual sugarcane plantation areas in 2020, sourced from the Office of the Cane and Sugar Board (OCSB), on the land suitability map was studied to determine the current situation of sugarcane land suitability. These findings indicated that actual sugarcane cultivation areas on the land suitability map (5,287 km2) were mostly cultivated in the S3 class (2,593 km2, 49.0%), followed by 43.2% (2,282 km2) of the S2 class and 6.7% (353 km2) of the S1 class. In addition, potential areas for sugarcane cultivation were analyzed to expand sugarcane cultivation areas and increase yield. It was observed that potential areas in the S1 class for sugarcane cultivation were 6,519 km2. Nakhon Ratchasima province showed the most potential areas for sugarcane cultivation (35%, 2,272 km2), followed by Khon Kaen (11%, 725 km2), Chaiyaphum (9%, 592 km2), Udon Thani (8%, 519 km2) and Surin (7%, 441 km2). Such provinces may be encouraged to convert from currently cultivating other crops (rice, corn, or cassava) to sugarcane to optimally utilize their resources. Government policies should support the participatory knowledge transfer programs on sugarcane cultivation, sugarcane price guarantee and credit access. Furthermore, the S2 class areas could potentially enhance by implementing irrigation systems, groundwater management, and establishing small ponds to reduce the drought risk. This approach could increase the sugarcane yield and encourage these areas into the S1 class, which expand the S1 class areas by 2.7 folds over the existing S1 class areas. The land suitability map in this study analyzed only prototype sugarcane areas in Northeastern Thailand. The different suitable sugarcane crop growth in this work can be used for crop management practices such as putting fertilizer, water management and other human controls. Therefore, future research should be studied on a larger scale covering the whole country to improve the accuracy of the map for decision-making and dealing with global climate change situations. Other factors should be incorporated to consider for mapping sugarcane land suitability, such as distance from groundwater, LU/LC, soil moisture, and climate data. Artificial Intelligence (AI) and machine learning approaches should be applied in the criteria classification to identify the misclassification and improve the suitability of land in further studies.",
    "speaker": "Piyanan Pipatsitee",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/QV8FJA/",
    "abstract_ja": "土地適性のマッピングは、用地選定や土地利用計画のために適切な土地利用を特定するための重要なアプローチである。しかし、気候変動は水不足や干ばつを悪化させ、土地適性に大きな影響を与え、特にサトウキビの作物収量の減少をもたらす。土地適性は通常、土壌特性、地形、気候、社会経済的要因など複数の基準に基づいて評価されるが、気候変動による作物収量への影響を緩和するためには、干ばつ条件を土地適性マッピングに組み込むことが不可欠である。そこで本研究では、タイの東北地方において、ファジーAHPと多基準評価アプローチを用いてサトウキビの土地適性をマッピングすることを目的とした。",
    "description_ja": "ファジーAHPと多基準評価の統合により、サトウキビ栽培に適した土地の再分析を行った。ETDIはサトウキビ栽培適地分析における重要な要素として適用され、土壌と植生の両方の条件を考慮して決定された0.66の平均因子加重が用いられた。また、河川からの距離も考慮され、その平均係数は0.34であった。その結果、サトウキビ適地（61,566 km2）は、そのほとんどが中適地（S2、30,521 km2、49.6％）であり、次いでやや適地（S3、22,208 km2、36.0％）、高適地（S1、6,872 km2、11.2％）であった。さらに、サトウキビの土地適性の現状を把握するため、OCSB（Office of the Cane and Sugar Board）から入手した土地適性地図上の2020年における実際のサトウキビ栽培面積を調査した。その結果、土地適性マップ上の実際のサトウキビ栽培面積（5,287 km2）は、そのほとんどがS3クラス（2,593 km2、49.0％）で栽培されており、次いでS2クラスが43.2％（2,282 km2）、S1クラスが6.7％（353 km2）であった。また、サトウキビの栽培面積を拡大し、収量を増加させるために、サトウキビ栽培の潜在的な可能性を分析した。その結果、S1クラスのサトウキビ栽培潜在面積は6,519 km2であることが確認された。ナコンラチャシマ県が最もサトウキビ栽培の可能性が高く（35％、2,272 km2）、次いでコンケン県（11％、725 km2）、チャイヤプーム県（9％、592 km2）、ウドンターニー県（8％、519 km2）、スリン県（7％、441 km2）であった。このような県では、現在他の作物（米、トウモロコシ、キャッサバ）を栽培しているが、資源を最適に活用するために、サトウキビに転換することが奨励されるかもしれない。政府の政策は、サトウキビ栽培に関する参加型知識移転プログラム、サトウキビの価格保証、信用アクセスを支援すべきである。さらに、S2クラスの地域では、灌漑システム、地下水管理、干ばつリスクを軽減するための小池の設置などを実施することで、灌漑を強化できる可能性がある。このようなアプローチにより、サトウキビの収量が増加し、これらの地域がS1クラスへ移行することを促し、S1クラス地域が既存のS1クラス地域の2.7倍に拡大する可能性がある。本研究の土地適性マップは、タイ東北部のサトウキビ原産地のみを分析したものである。本研究で得られたサトウキビ作物の生育適地は、施肥、水管理、その他人為的な管理などの作物管理に利用することができる。したがって、今後の研究では、意思決定や地球規模の気候変動に対応するためのマップの精度を向上させるために、タイ全土をカバーする大規模な調査を行う必要がある。地下水からの距離、LU/LC、土壌水分、気候データなど、サトウキビ適地マップを作成するために考慮すべき他の要素も取り入れるべきである。人工知能(AI)と機械学習アプローチを基準分類に適用し、誤分類を特定し、さらなる研究で土地の適性を改善すべきである。"
  },
  {
    "title": "Leveraging spatial autocorrelation information of remotely sensed evapotranspiration for mitigating the impact of data uncertainty on hydrological modeling",
    "date": "2024-12-16",
    "time_range": "14:50-15:10",
    "location": "Room34-1102",
    "abstract": "Global remotely sensed evapotranspiration (RS-ET) products are increasingly pivotal in enhancing the accuracy and scope of hydrological modeling, particularly in regions where traditional ground-based streamflow data are sparse or non-existent. These products play a pivotal role in understanding the dynamics of the climate-soil-vegetation system, where evapotranspiration constitutes a substantial portion of water loss following precipitation events. Their extensive spatial coverage and accessibility have significantly expanded the capability to predict hydrological dynamics in ungauged basins, offering insights that were previously inaccessible through in-situ observations alone.",
    "description": null,
    "speaker": "Yan He",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/D3LAUM/",
    "abstract_ja": "全球リモートセンシング蒸発散（RS-ET）データは、水文学モデリングの精度と範囲を向上させる上で、特に従来の地上ベースの流況データがまばらであるか存在しない地域において、ますます極めて重要なものとなっている。これらのプロダクトは、気候-土壌-植生システムの動態を理解する上で極めて重要な役割を果たしており、蒸発散は降水後の水損失のかなりの部分を占めている。その広範な空間的範囲と利用しやすさは、未測量の流域における水文学的動態を予測する能力を大幅に拡大し、以前は現場観測だけではアクセスできなかった洞察を提供している。"
  },
  {
    "title": "Experience Digital Twin applications enhanced by AI prompts",
    "date": "2024-12-16",
    "time_range": "15:00-15:15",
    "location": "Auditorium Hall 1",
    "abstract": "The range of AI applications in the geospatial information field is diverse, object detection, area extraction, change detection, and super-resolution. In our industry, we collectively refer to these technologies as GeoAI.",
    "description": "This work was supported by KOFPI(Korea Forestry Promotion Institute) through \"Development of Integrated Decision Supporting System for Managing Forest Fires based a Digital platform using Artificial Intelligence\" Program(or Project), funded by Korea Forest Service (grant number: RS-2024-00402509/2400000028)",
    "speaker": "Hanjin Lee",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/39E8PC/",
    "abstract_ja": "地理空間情報分野におけるAIの応用範囲は、物体検出、領域抽出、変化検出、超解像など多岐にわたる。我々の業界では、これらの技術を総称してGeoAIと呼んでいる。",
    "description_ja": "本研究は、KOFPI(韓国林業振興院)の「人工知能を用いたデジタルプラットフォームに基づく森林火災管理のための統合意思決定支援システムの開発」プログラム(またはプロジェクト)の支援を受けて行われた。"
  },
  {
    "title": "The QGIS Shredder Plugin Inspired by Banksy’s Shredder: Sustainable shredder with no waste",
    "date": "2024-12-16",
    "time_range": "15:00-15:15",
    "location": "Auditorium Hall 2",
    "abstract": "In October 2018, the art world witnessed an unprecedented event when Banksy’s “Girl with Balloon” partially shredded itself immediately after being auctioned at Sotheby’s. This bold act challenged traditional perceptions of art, value, and the role of the artist. Drawing inspiration from this event, I developed a unique QGIS plugin that  shreds layers.",
    "description": "In October 2018, the art world witnessed an unprecedented event when Banksy’s “Girl with Balloon” partially shredded itself immediately after being auctioned at Sotheby’s. This bold act challenged traditional perceptions of art, value, and the role of the artist. Drawing inspiration from this event, I developed a unique QGIS plugin that  shreds layers.",
    "speaker": "Naoya Nishibayashi",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/XEZMUZ/",
    "abstract_ja": "2018年10月、バンクシーの「風船を持つ少女」がサザビーズのオークションに出品された直後に一部が破砕されるという前代未聞の出来事がアート界で起きた。この大胆な行為は、アート、価値、アーティストの役割に対する従来の認識を覆すものだった。この出来事からインスピレーションを得て、私はレイヤーを細断するユニークなQGISプラグインを開発した。",
    "description_ja": "2018年10月、バンクシーの「風船を持つ少女」がサザビーズのオークションに出品された直後に一部が破砕されるという前代未聞の出来事がアート界で起きた。この大胆な行為は、アート、価値、アーティストの役割に対する従来の認識を覆すものだった。この出来事からインスピレーションを得て、私はレイヤーを細断するユニークなQGISプラグインを開発した。"
  },
  {
    "title": "Spatio-Temporal Drought Monitoring in the Chi River Basin from 2001–2020 Using MODIS Time Series and Google Earth Engine",
    "date": "2024-12-16",
    "time_range": "15:10-15:30",
    "location": "Room34-1104",
    "abstract": "Drought is a recurring issue in South Asia (SA) caused by extreme climate events, posing ongoing challenges for food management, sustainable agricultural practices, and livelihoods, especially in frequently affected areas. Earth Observation (EO) data provides valuable information for long-term drought monitoring across wide regions. However, there remains a need to map and monitor spatial drought events over large regions and extended periods, particularly in the Chi River Basin. In this region, droughts have increasingly occurred with high frequency, leading to low water-holding capacity and adversely affecting agricultural production and productivity.",
    "description": null,
    "speaker": "Jaturong Som-ard",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/QPWNEZ/",
    "abstract_ja": "干ばつは、南アジア（SA）において、特に頻繁に被害を受ける地域において、食料管理、持続可能な農業慣行、および生計に継続的な課題をもたらしている、異常な気候現象によって引き起こされる繰り返し起こる問題である。地球観測（EO）データは、広い地域にわたる長期的な干ばつモニタリングのための貴重な情報を提供する。しかし、特にチー川流域では、広域かつ長期間にわたる空間的な干ばつ事象を地図化し、監視する必要性が残っている。この地域では、干ばつが高い頻度で発生するようになり、保水力の低下を招き、農業生産と生産性に悪影響を及ぼしている。"
  },
  {
    "title": "The relationship between PM2.5 and solar cell electricity generation Using  Aerosol Optical Depth (AOD)",
    "date": "2024-12-16",
    "time_range": "15:10-15:30",
    "location": "Room34-1102",
    "abstract": "This study aims to analyze the relationship between PM2.5 concentrations, derived from Aerosol Optical Depth (AOD), and solar power generation a solar farm owned by A. Co., Ltd.(alias), in Samut Prakan Province, Thailand, This research utilizes PM2.5 data from pollution monitoring stations of the Pollution Control Department, AOD data from the MCD19A2.061 product, and solar power generation data from the Electricity Generating Authority of Thailand in 2022. The results indicate in summer season a negative correlation between PM2.5 concentrations and solar power generation R² = -0.7, meaning that as PM2.5 levels increase, solar power generation decreases. A regression equation used for power prediction achieved an accuracy of R² = 0.97. In contrast, a positive correlation is observed during the winter season R² = 0.6, indicating that as PM2.5 levels increase, solar power generation increases, with a prediction accuracy of R² = 0.93. No significant correlation is found during the rainy season, which may be due to other influencing factors. Predicting solar power generation in other areas should consider the different physical factors unique to each location.\nKeywords: PM2.5, Aerosol Optical Depth, Solar Power, Solar Farm",
    "description": null,
    "speaker": "Sunattha Lalaeng",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/WKWNW7/",
    "abstract_ja": "本研究は、タイ国サムットプラカーン県にあるA.Co.Ltd.(通称)が所有する太陽光発電所のエアロゾル光学深度(AOD)から得られるPM2.5濃度と太陽光発電量の関係を分析することを目的としている。本研究では、タイ国公害管理局の公害モニタリングステーションからのPM2.5データ、MCD19A2.061プロダクトからのAODデータ、タイ国発電公社からの2022年の太陽光発電量データを利用した。その結果、夏季において、PM2.5濃度と太陽光発電量の間に負の相関R²=-0.7があることが示された。これは、PM2.5レベルが増加すると、太陽光発電量が減少することを意味する。発電量の予測に使用した回帰式は、R² = 0.97の精度を達成した。対照的に、冬季には正の相関が観察され、R² = 0.6。これは、PM2.5レベルが上昇すると、太陽光発電量が増加することを示し、予測精度はR² = 0.93であった。雨季には有意な相関は見られず、これは他の影響要因によるものと考えられる。他の地域での太陽光発電の予測は、それぞれの場所に特有の異なる物理的要因を考慮する必要がある。\nキーワードPM2.5、エアロゾル光学的深度、太陽光発電、ソーラーファーム"
  },
  {
    "title": "Exploring Segment Anything Model's Potential in Geospatial Data: Case Studies for Landslide and Forest Canopy Detection",
    "date": "2024-12-16",
    "time_range": "15:15-15:30",
    "location": "Auditorium Hall 2",
    "abstract": "In recent years, the availability of geospatial data has significantly increased, with aerial photographs and Digital Elevation Models (DEMs) becoming widely accessible as open data. Additionally, the acquisition of high-resolution image data through drones has become more feasible and commonplace. However, extracting meaningful information from these vast datasets remains a labor-intensive process, often requiring significant time and resources.",
    "description": null,
    "speaker": "Nobusuke Iwasaki",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/NFCUBG/",
    "abstract_ja": "近年、航空写真やデジタル標高モデル（DEM）がオープンデータとして広く利用できるようになるなど、地理空間データの利用可能性は著しく高まっている。また、ドローンによる高解像度の画像データの取得も、より現実的かつ一般的になってきた。しかし、これらの膨大なデータセットから意味のある情報を抽出するのは、依然として労力のかかるプロセスであり、多くの場合、多大な時間とリソースを必要とする。"
  },
  {
    "title": "Rust for Geospatial Data Processing: A Case Study with CityGML Converter for PLATEAU, Japan's Open Digital Twin Models",
    "date": "2024-12-16",
    "time_range": "15:15-15:30",
    "location": "Auditorium Hall 1",
    "abstract": null,
    "description": "Rust is an open-source programming language renowned for its performance, reliability, and productivity. This case study focuses on our experience developing an official CityGML converter for PLATEAU, a project led by Japan's Ministry of Land, Infrastructure, Transport, and Tourism to model and utilize digital twin open data. The tool is publicly available as open-source software: https://github.com/Project-PLATEAU/PLATEAU-GIS-Converter",
    "speaker": "Sorami Hisamoto",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/LXQ87Z/",
    "description_ja": "Rustは、そのパフォーマンス、信頼性、生産性で有名なオープンソースのプログラミング言語です。このケーススタディでは、日本の国土交通省が主導するデジタルツイン・オープンデータのモデル化と活用を目的としたプロジェクト「PLATEAU」の公式CityGMLコンバータを開発した経験に焦点を当てています。このツールはオープンソースソフトウェアとして公開されています： https://github.com/Project-PLATEAU/PLATEAU-GIS-Converter"
  },
  {
    "title": "Introducing Re:Earth Visualizer - No-Code 3D WebGIS Powered by Cesium -",
    "date": "2024-12-16",
    "time_range": "15:30-15:45",
    "location": "Auditorium Hall 1",
    "abstract": "In this session, we will introduce Re:Earth Visualizer, a 3D WebGIS platform, covering its overview, features, technical components, and use cases. \nRe:Earth Visualizer is open-source tool that allows non-engineers to visualize data on maps without coding and publish it on the Web. It also includes a plugin system that enables users to develop and add custom functions like QGIS.",
    "description": "We will introduce Re:Earth Visualizer overview, features, technical elements, and use cases.\nRe:Earth is our brand, and Visualizer is the first product under this brand.\nRe:Earth Visualizer is a WebGIS tool that allows users to upload or create GIS data, visualize it, customize styles, create stories, publish their work, and much more.\nYou can use 3D data such as 3D Tiles or 3D models in glTF format in Re:Earth",
    "speaker": "Hinako Iseki",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/J7DZR8/",
    "abstract_ja": "本セッションでは、3D WebGISプラットフォームであるRe:Earth Visualizerについて、その概要、特徴、技術要素、ユースケースを紹介します。\nRe:Earth Visualizerは、非エンジニアでもコーディングなしで地図上のデータを可視化し、Web上で公開できるオープンソースのツールです。また、QGISのようなカスタム機能を開発・追加できるプラグインシステムも備えています。",
    "description_ja": "Re:Earthビジュアライザーの概要、特徴、技術要素、使用例を紹介します。\nRe:Earthは私たちのブランドであり、Visualizerはこのブランドの最初の製品です。\nRe:Earth Visualizerは、GISデータのアップロードや作成、ビジュアライズ、スタイルのカスタマイズ、ストーリーの作成、作品の公開などを可能にするWebGISツールです。\nRe:Earthでは、3DタイルやglTF形式の3Dモデルなどの3Dデータを使用することができます。"
  },
  {
    "title": "Land Use Detection Using Artificial Intelligence",
    "date": "2024-12-16",
    "time_range": "15:30-15:45",
    "location": "Auditorium Hall 2",
    "abstract": "Automating land use surveys in rural areas using advanced AI techniques can significantly enhance the efficiency and accuracy of identifying various land features. This project focuses on utilizing the YOLOv8 framework for land use detection through image segmentation and object detection.\nTraditional land use surveys in rural areas are time-consuming and often prone to inaccuracies due to manual methods. Leveraging artificial intelligence, particularly deep learning models, presents a promising solution to streamline this process and improve data reliability. The project addresses the challenge of automating land feature identification, which includes detecting houses, rivers, roads, and vegetation from visual data captured by satellite/drone. Accurate identification of these features is crucial for effective rural planning and development, as it helps in resource allocation and infrastructure development. The limitations of conventional methods, such as the need for extensive human labor and susceptibility to human error, further highlight the necessity for innovative solutions like AI-driven land use surveys.\nThe primary aim of this study is to develop and train an AI model capable of accurately detecting and segmenting various land features in rural landscapes. By doing so, the project seeks to demonstrate the applicability of AI in enhancing rural development planning and management. The specific objectives include creating a reliable dataset of annotated aerial images, optimizing a deep learning model for high accuracy, and evaluating the model's performance across different types of land features. Ultimately, the project aims to provide a scalable and efficient tool that can assist policymakers, researchers, and rural development planners in making informed decisions.\nThe methodology involved several key steps to ensure the robustness and accuracy of the AI model. First, a diverse dataset of aerial images was collected, encompassing various rural landscapes with distinct features such as houses, rivers, roads, and farms/vegetation. These images were meticulously annotated using specialized tools to create ground truth data for training and validation. Data augmentation techniques, including rotations, flips, and color adjustments, were employed to expand the dataset and improve the model's generalization capabilities.\nThe YOLOv8 model was selected for its state-of-the-art performance in object detection and segmentation tasks. YOLOv8's architecture is well-suited for real-time applications due to its balance between accuracy and speed. The model was trained using the annotated dataset, with hyperparameters optimized to enhance its detection and segmentation performance. Training was conducted on a high-performance computing setup, leveraging GPU acceleration to expedite the process.\nThe results demonstrated the model's high precision in detecting and segmenting land features. The YOLOv8 model achieved notable accuracy metrics across various classes. The segmentation masks generated by the model closely matched the ground truth annotations, indicating its effectiveness in distinguishing different land features.\nThe findings of this study underscore the potential of AI in transforming rural development practices. The successful application of the YOLOv8 model for land use detection highlights its capability to deliver precise and actionable insights. The practical implications of this project are significant, offering a scalable solution for land survey automation, which can greatly assist policymakers and rural planners. The integration of such AI-driven methodologies can lead to more informed decision-making, efficient resource allocation, and ultimately, the betterment of rural communities.\nThe study also highlights several challenges and limitations encountered during the project. Data collection in rural areas can be logistically challenging, often requiring collaboration with local authorities and stakeholders. Ensuring the diversity and quality of the dataset is crucial, as biased or insufficient data can affect the model's performance. Additionally, the model's accuracy is dependent on the quality of annotations, which requires meticulous effort and expertise.\nDespite these challenges, the project demonstrates that AI can significantly enhance the accuracy and efficiency of land use surveys. The use of deep learning models like YOLOv8 can reduce the reliance on manual methods, providing a more reliable and scalable solution. However, continuous efforts are needed to improve the dataset, address potential biases, and refine the model to handle more complex scenarios.\nIn conclusion, this project not only advances the field of AI in rural development but also sets a precedent for future studies aiming to leverage AI for similar applications. The integration of AI in land use surveys can revolutionize the way rural areas are planned and developed, leading to more sustainable and efficient outcomes. The success of this project inspires further research and development in AI-driven solutions for rural development, with the potential to make a lasting positive impact on rural communities worldwide.",
    "description": null,
    "speaker": "Amritesh Hiras",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/KQBSJ9/",
    "abstract_ja": "高度なAI技術を用いて農村部における土地利用調査を自動化することで、様々な土地の特徴を特定する効率と精度を大幅に向上させることができる。このプロジェクトでは、YOLOv8フレームワークを活用し、画像セグメンテーションとオブジェクト検出による土地利用検出に焦点を当てる。\n農村部における従来の土地利用調査は時間がかかり、手作業によるため不正確になりがちである。人工知能、特にディープラーニングモデルの活用は、このプロセスを合理化し、データの信頼性を向上させる有望な解決策を提示する。このプロジェクトでは、衛星やドローンで撮影された視覚データから家屋、河川、道路、植生を検出することを含む、土地の特徴識別の自動化という課題に取り組んでいる。これらの特徴を正確に特定することは、資源配分やインフラ整備に役立つため、効果的な農村計画と開発にとって極めて重要である。大規模な人手が必要であったり、人為的ミスが起こりやすかったりといった従来の手法の限界は、AIを活用した土地利用調査のような革新的なソリューションの必要性をさらに際立たせている。\n本研究の主な目的は、農村景観における様々な土地の特徴を正確に検出・区分できるAIモデルを開発・訓練することである。そうすることで、このプロジェクトは、農村開発の計画と管理を強化する上でのAIの適用可能性を実証しようとするものである。具体的な目標には、注釈付き航空画像の信頼できるデータセットを作成すること、高精度を実現するためにディープラーニング・モデルを最適化すること、異なるタイプの土地の特徴にわたってモデルの性能を評価することなどが含まれる。最終的に、このプロジェクトは、政策立案者、研究者、農村開発プランナーが情報に基づいた意思決定を行う際に役立つ、スケーラブルで効率的なツールを提供することを目指している。\nAIモデルのロバスト性と精度を確保するため、方法論にはいくつかの重要なステップがあった。まず、家屋、河川、道路、農地、植生などの特徴を持つ様々な農村景観を網羅する、多様な航空画像のデータセットを収集した。これらの画像は、訓練と検証のためのグランドトゥルースデータを作成するために、専用のツールを使用して細心の注意を払って注釈が付けられた。データセットを拡張し、モデルの汎化能力を向上させるために、回転、反転、色調整などのデータ拡張技術が採用された。\nYOLOv8モデルは、物体検出とセグメンテーションタスクにおける最先端の性能のために選択された。YOLOv8のアーキテクチャは、精度と速度のバランスが取れているため、リアルタイムアプリケーションに適している。モデルは、検出とセグメンテーションの性能を向上させるために最適化されたハイパーパラメータを用いて、注釈付きデータセットを用いて学習された。トレーニングは、GPUアクセラレーションを活用したハイパフォーマンスコンピューティングセットアップ上で実施され、プロセスを高速化した。\nその結果、土地の特徴の検出とセグメンテーションにおけるモデルの精度の高さが実証された。YOLOv8モデルは、さまざまなクラスで注目すべき精度指標を達成した。モデルによって生成されたセグメンテーションマスクは、グランドトゥルースのアノテーションと密接に一致し、異なる土地の特徴を区別するのに有効であることを示した。\n本研究の結果は、農村開発の実践を変革するAIの可能性を強調するものである。YOLOv8モデルの土地利用検出への応用の成功は、正確で実用的な洞察を提供するその能力を浮き彫りにした。このプロジェクトの実用的な意義は大きく、土地調査の自動化のためのスケーラブルなソリューションを提供し、政策立案者や農村計画者を大いに支援することができる。このようなAI主導の方法論を統合することで、より多くの情報に基づいた意思決定、効率的な資源配分、ひいては農村地域の改善につながる。\nこの研究では、プロジェクト中に遭遇したいくつかの課題と限界も明らかにしている。農村部でのデータ収集は論理的に困難な場合があり、多くの場合、地方自治体や利害関係者との協力が必要となる。データの偏りや不足はモデルの性能に影響を及ぼす可能性があるため、データセットの多様性と質を確保することは極めて重要である。さらに、モデルの精度はアノテーションの質に左右されるため、細心の努力と専門知識が必要とされる。\nこうした課題にもかかわらず、このプロジェクトは、AIが土地利用調査の精度と効率を大幅に向上できることを示している。YOLOv8のようなディープラーニング・モデルを使用することで、手作業への依存を減らし、より信頼性が高くスケーラブルなソリューションを提供することができる。しかし、データセットを改善し、潜在的なバイアスに対処し、より複雑なシナリオに対応できるようにモデルを改良するためには、継続的な努力が必要である。\n結論として、このプロジェクトは農村開発におけるAIの分野を前進させるだけでなく、同様の用途にAIを活用することを目指す今後の研究の先例となる。土地利用調査にAIを統合することで、農村地域の計画・開発方法に革命をもたらし、より持続可能で効率的な結果を導くことができる。このプロジェクトの成功は、世界の農村地域に永続的な好影響を与える可能性を秘めた、農村開発のためのAI主導型ソリューションのさらなる研究開発を鼓舞するものである。"
  },
  {
    "title": "The Application of Google Earth Engine for PM2.5 Estimation to Analyze PM2.5 Distribution From in Saraburi Province",
    "date": "2024-12-16",
    "time_range": "15:30-15:50",
    "location": "Room34-1102",
    "abstract": "This research aims to estimate PM2.5 concentrations from Aerosol Optical Depth (AOD) and meteorological data and study the spatial distribution patterns of PM2.5 in Saraburi Province. The estimation of PM2.5 levels is conducted using AOD data combined with meteorological data through a Multiple Linear Regression (MLR) method. The estimated values are then used to analyze the distribution patterns of PM2.5. The study found that in 2018, the average monthly PM2.5 concentration ranged from 0 to 74.1 μg/m³, with high-value clustering (hot spots) covering approximately 421.43 km², or 12.04% of the provincial area. In 2019, the average monthly PM2.5 concentration ranged from 0 to 41.4 μg/m³, with hot spots covering approximately 509.29 km², or 14.55% of the provincial area. In 2020, the average monthly PM2.5 concentration ranged from 0 to 50.0 μg/m³, with hot spots covering approximately 648.37 km², or 18.53% of the provincial area. In 2021, the average monthly PM2.5 concentration ranged from 0 to 55.3 μg/m³, with hot spots covering approximately 562.93 km², or 16.09% of the provincial area. In 2022, the average monthly PM2.5 concentration ranged from 0 to 57.3 μg/m³, with hot spots covering approximately 615.97 km², or 18% of the provincial area. The most of high-value clusters were in the western part of the province, where agricultural activities are prevalent, contributing to higher PM2.5 levels. In contrast, low-value clusters (cold spots) were primarily found in the eastern part of the province, which is largely forested.",
    "description": "This study utilized Google Earth Engine to obtain and analyze satellite images and meteorological data for estimating PM2.5 in Saraburi, Thailand. Moreover, spatial analysis techniques were used to detect the spatial pattern of PM2.5, which will be important information for solving the problem in the area.\nNote:\nThis paper is a part of the master thesis at SWU.",
    "speaker": "Pattara",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/Q8QZUZ/",
    "abstract_ja": "本研究の目的は、エアロゾル光学深度（AOD）と気象データからPM2.5濃度を推定し、サラブリ県におけるPM2.5の空間分布パターンを研究することである。PM2.5濃度の推定は、AODデータと気象データを重回帰（MLR）法により組み合わせて行う。その後、推定値を用いてPM2.5の分布パターンを分析する。調査の結果、2018年の月平均PM2.5濃度は0～74.1μg/m³の範囲にあり、値の高い集積（ホットスポット）は約421.43km²、州面積の12.04％を占めていた。2019年、月平均PM2.5濃度は0～41.4μg/m³で、ホットスポットは州面積の14.55%にあたる約509.29km²をカバーした。2020年の月平均PM2.5濃度は0～50.0μg/m³で、ホットスポットは州面積の約648.37km²、18.53%を占める。2021年の月平均PM2.5濃度は0～55.3μg/m³で、ホットスポットは州面積の16.09%にあたる約562.93km²をカバーした。2022年には、月平均PM2.5濃度は0～57.3μg/m³の範囲にあり、ホットスポットは約615.97km²、州面積の18%を占めていた。PM2.5濃度の高いクラスターは、農業活動が盛んな州西部に多く、PM2.5濃度の上昇に寄与している。対照的に、価値の低いクラスター（コールドスポット）は、主に森林が多い州東部に見られた。",
    "description_ja": "本研究では、Google Earth Engineを利用して衛星画像と気象データを取得・解析し、タイのサラブリにおけるPM2.5を推定した。さらに、空間解析技術を用いてPM2.5の空間パターンを検出し、この地域における問題解決のための重要な情報とした。\n注\nこの論文はSWUの修士論文の一部である。"
  },
  {
    "title": "Hydrogeophysical Analysis of Vertical Electrical Soundings for Groundwater Potential and Aquifer Vulnerability Evaluation in the Federal Capital Territory, Abuja, Nigeria",
    "date": "2024-12-16",
    "time_range": "15:30-15:50",
    "location": "Room34-1104",
    "abstract": "According to the United Nations World Water Development Report, groundwater accounts for 26% of the world's renewable freshwater, with around 2.5 billion people relying primarily on it for basic water needs. The most realistic and cost-effective strategy to increase universal access to clean water, meet the 2030 sustainable development goals (SDG), and minimize climate change impacts is broad exploitation and management of groundwater. The study area is Nigeria's capital Abuja, generally characterized by moderate precipitation and few surface water sources. The water treatment plant, designed with a capacity of 10,000 cubic meters per hour of treated water, was aimed at supporting a population of 500,000 people 34 years ago. However, due to population growth and urbanization, the water supply is no longer meeting demand. Groundwater demand and consumption in Abuja have increased significantly over the last decade due to fast population expansion, urbanization, and industrialization. Understanding groundwater potential and aquifer vulnerability is critical for sustainable resource management.",
    "description": "This research integrates the aspect of geophysics with geographic information system (GIS) technology to delineate groundwater potential zones and characterize the aquifer vulnerability in the study area. This was achieved through analytical and qualitative analysis of the Vertical Electrical Sounding (VES) data and the Dar-Zarrouk parameters to have a detailed understanding of the subsurface.",
    "speaker": "DANLAMI IBRAHIM",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/YQSBBP/",
    "abstract_ja": "国連世界水開発報告（World Water Development Report）によると、地下水は世界の再生可能な淡水の26％を占め、約25億人が基本的な水需要を主に地下水に依存している。清潔な水への普遍的なアクセスを増やし、2030年の持続可能な開発目標（SDG）を達成し、気候変動の影響を最小限に抑えるための最も現実的で費用対効果の高い戦略は、地下水の幅広い利用と管理である。調査対象地域はナイジェリアの首都アブジャで、一般的に降水量が少なく、地表水源が少ないという特徴がある。毎時1万立方メートルの処理能力を持つ浄水場は、34年前、50万人の人口を支えることを目的に設計された。しかし、人口の増加と都市化により、給水量はもはや需要を満たしていない。アブジャ市の地下水需要と消費量は、急速な人口拡大、都市化、工業化により、過去10年間で大幅に増加している。持続可能な資源管理には、地下水の潜在力と帯水層の脆弱性を理解することが重要である。",
    "description_ja": "本研究は、物理学と地理情報システム（GIS）技術を統合し、地下水ポテンシャルゾーンを特定し、調査地域における帯水層の脆弱性を評価するものである。これは、Vertical Electrical Sounding (VES)データとDar-Zarroukパラメータを分析・定性分析し、地下の詳細な理解を得ることで達成された。"
  },
  {
    "title": "Iteration-free methods for Earth observation data time-series reconstruction",
    "date": "2024-12-16",
    "time_range": "15:45-16:00",
    "location": "Auditorium Hall 2",
    "abstract": "Clouds, atmospheric disturbances, and sensor failures influence the quality of Earth observation (EO) data and satellite images, in particular. Many modeling techniques and statistical analysis, to be applied to EO data, require the detection and removal of such aberrations. However, the data gap created after removing the involved pixels needs to be imputed with numerical values that resemble the expected noncorrupted ones. Several imputation, or gap-filling, methods available in literature are based on time-series reconstruction, working only on the temporal dimension of each pixel to input the missing values. Such methods, compared to alternative ones that also consider spatial neighbor pixels or data fusion with other sensors, have the advantage of maintaining the same spatial resolution and spectral consistency in the imputed data.\nIn contrast with methods that only work with a local temporal window, some of these methods take advantage of the whole time series of each pixel to reconstruct each missing value, allowing the full reconstruction of each gappy time-series. Nevertheless, such methods, like most recent image propagation or linear interpolation, often require an iterative search of available values along the time-series. When the time-series is composed of several samples and/or the involved number of pixels is large, the application of such methods leads to prohibitive computational costs.",
    "description": "Clouds, atmospheric disturbances, and sensor failures affect the quality of Earth observation (EO) data, necessitating the detection and removal of these aberrations, followed by imputation of missing values. Traditional gap-filling methods based on time-series reconstruction can be computationally expensive. We present a computational framework that using discrete convolution offers an efficient solution for reconstructing large-scale EO datasets and supports various time-series reconstruction methods. The code is openly available on GitHub under the scikit-map repository.",
    "speaker": "Davide Consoli",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/7AN83C/",
    "abstract_ja": "雲、大気の乱れ、センサーの故障は、特に地球観測（EO）データや衛星画像の品質に影響を与える。EOデータに適用される多くのモデリング技術や統計解析では、このような収差を検出して除去する必要がある。しかし、そのようなピクセルを除去した後に生じるデータギャップを、期待される非汚染ピクセルに類似した数値でインピュテーションする必要がある。文献で利用可能ないくつかのインピュテーション（ギャップ埋め）手法は、時系列再構成に基づいており、欠損値を入力するために各画素の時間次元のみで動作します。このような方法は、空間的な近傍ピクセルや他のセンサーとのデータフュージョンも考慮する代替方法と比較して、インプットされたデータにおいて同じ空間分解能とスペクトルの一貫性を維持できるという利点があります。\n局所的な時間窓のみを使用する方法とは対照的に、これらの方法の中には、各画素の全時系列を利用して各欠損値を再構成するものもあり、各ギャップ時系列の完全な再構成が可能である。とはいえ、このような方法は、最近の画像伝播や線形補間と同様に、時系列に沿って利用可能な値を繰り返し探索する必要があることが多い。時系列が複数のサンプルで構成されていたり、関係するピクセルの数が多かったりする場合、このような方法を適用すると、法外な計算コストがかかる。",
    "description_ja": "雲、大気の乱れ、センサーの故障は地球観測（EO）データの品質に影響を与えるため、これらの異常の検出と除去、そして欠損値のインピュテーションが必要となる。時系列再構成に基づく従来のギャップ充填法は計算コストが高い。我々は、離散畳み込みを使用することで、大規模なEOデータセットを再構成するための効率的なソリューションを提供し、様々な時系列再構成法をサポートする計算フレームワークを提示する。コードはGitHubのscikit-mapリポジトリで公開されている。"
  },
  {
    "title": "MSpace.E: Advanced Urban Environment Simulation Platform",
    "date": "2024-12-16",
    "time_range": "15:45-16:00",
    "location": "Auditorium Hall 1",
    "abstract": "“toeng.net”, which we announced at FOSS4G-ASIA 2023 Seoul, will be launched as “MSpace.E”.\nMSpace.E is a comprehensive urban environment analysis platform using 3D city models. This platform integrates simulations of shadows, building surface shadows, noise, and wind, providing an approach to urban planning and environmental assessment.",
    "description": null,
    "speaker": "NGUYEN VAN THIEN",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/TUJLSB/",
    "abstract_ja": "FOSS4G-ASIA 2023 Seoulで発表した \"toeng.net \"が \"MSpace.E \"として始動します。\nMSpace.Eは、3D都市モデルを用いた総合的な都市環境解析プラットフォームです。このプラットフォームは、影、建物表面の影、騒音、風のシミュレーションを統合し、都市計画や環境評価へのアプローチを提供します。"
  },
  {
    "title": "Mapping Urban Dynamics: The Role of Data Analysis in Shaping Sustainable Cities",
    "date": "2024-12-16",
    "time_range": "16:15-16:30",
    "location": "Auditorium Hall 1",
    "abstract": "The integration of vast data analysis and AI technologies in urban planning represents a significant advancement in managing the complexities of modern cities. Through this presentation, it show the vast potential of these technologies to enhance decision-making, optimize resource allocation, and improve urban sustainability. By understanding and applying these technologies, future urban planners can develop smarter, more efficient, and environmentally friendly cities. The practical applications discussed, including traffic injury risk assessment, human mobility analysis, and carbon emission estimation, demonstrate the tangible benefits of leveraging Big Earth Data and AI in urban planning.",
    "description": null,
    "speaker": "Sarawut ninsawat",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/NQYUGR/",
    "abstract_ja": "都市計画における膨大なデータ分析とAI技術の統合は、複雑な現代都市を管理する上で大きな進歩を意味する。このプレゼンテーションでは、意思決定を強化し、資源配分を最適化し、都市の持続可能性を向上させるために、これらの技術が持つ大きな可能性を示す。これらの技術を理解し応用することで、未来の都市計画者は、より賢く、より効率的で、環境に優しい都市を開発することができる。交通事故のリスク評価、人の移動の分析、二酸化炭素排出量の推定など、議論されている実用的なアプリケーションは、都市計画におけるビッグアースデータとAIの活用がもたらす具体的な利点を示している。"
  },
  {
    "title": "Empowering Citizen Scientists for Safer and Resilient Communities: A Story of Creating a Metro Manila Climate and Disaster Risk Atlas through QGIS and OSM",
    "date": "2024-12-16",
    "time_range": "16:15-16:30",
    "location": "Room34-1102",
    "abstract": "Disasters like typhoons, earthquakes, and flooding are inevitable, especially as climate change intensifies. This heightens the need for effective information sharing, which some governments have addressed by sending out timely digital alerts. While large organizations work to prepare communities for disasters, local knowledge often gets overlooked despite its critical role in understanding a hazard’s impact. Residents possess intimate knowledge of their surroundings, which becomes invaluable during emergencies for identifying evacuation routes and understanding the landscape. In creating a disaster risk assessment, selecting data sources is crucial, as demonstrated by the Metro Manila Climate and Disaster Risk Atlas. This atlas, created using QGIS and OSM, assesses hazards in Metro Manila—a region prone to a potential 7.2 magnitude earthquake due to the West Valley Fault System. Leveraging these tools, provides a comprehensive view of risks, empowering communities with vital information about the vulnerabilities and resilience of their locales. The project exemplifies how integrating local and digital knowledge fosters a safer, more prepared society.",
    "description": "Disasters like typhoons, earthquakes, and flooding are inevitable, especially as climate change intensifies. This heightens the need for effective information sharing, which some governments have addressed by sending out timely digital alerts. While large organizations work to prepare communities for disasters, local knowledge often gets overlooked despite its critical role in understanding a hazard’s impact. Residents possess intimate knowledge of their surroundings, which becomes invaluable during emergencies for identifying evacuation routes and understanding the landscape. In creating a disaster risk assessment, selecting data sources is crucial, as demonstrated by the Metro Manila Climate and Disaster Risk Atlas. This atlas, created using QGIS and OSM, assesses hazards in Metro Manila—a region prone to a potential 7.2 magnitude earthquake due to the West Valley Fault System. Leveraging these tools, provides a comprehensive view of risks, empowering communities with vital information about the vulnerabilities and resilience of their locales. The project exemplifies how integrating local and digital knowledge fosters a safer, more prepared society.",
    "speaker": "Janica Kylle De Guzman",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/9EWY9A/",
    "abstract_ja": "台風、地震、洪水などの災害は、特に気候変動が激化するにつれて避けられないものとなっている。このため、効果的な情報共有の必要性が高まっており、一部の政府はタイムリーなデジタル警報を発信することで対応している。大規模な組織が地域社会の災害対策に取り組む一方で、地域の知識は災害の影響を理解する上で重要な役割を担っているにもかかわらず、見過ごされがちである。住民は、自分たちの住んでいる地域に関する深い知識を持っており、非常時には避難経路を特定したり、景観を理解したりする上で非常に貴重なものとなる。災害リスクアセスメントを作成する上で、データソースの選定は極めて重要であることは、マニラ首都圏気候・災害リスクアトラスが証明している。QGISとOSMを使って作成されたこのアトラスは、ウェストバレー断層系によるマグニチュード7.2の地震が発生しやすいマニラ首都圏の危険性を評価している。これらのツールを活用することで、リスクを包括的に把握し、地域の脆弱性と回復力に関する重要な情報を地域社会に提供することができる。このプロジェクトは、地域とデジタルの知識を統合することで、より安全で備えのある社会が育まれることを例証している。",
    "description_ja": "台風、地震、洪水などの災害は、特に気候変動が激化するにつれて避けられないものとなっている。このため、効果的な情報共有の必要性が高まっており、一部の政府はタイムリーなデジタル警報を発信することで対応している。大規模な組織が地域社会の災害対策に取り組む一方で、地域の知識は災害の影響を理解する上で重要な役割を担っているにもかかわらず、見過ごされがちである。住民は、自分たちの住んでいる地域に関する深い知識を持っており、非常時には避難経路を特定したり、景観を理解したりする上で非常に貴重なものとなる。災害リスクアセスメントを作成する上で、データソースの選定は極めて重要であることは、マニラ首都圏気候・災害リスクアトラスが証明している。QGISとOSMを使って作成されたこのアトラスは、ウェストバレー断層系によるマグニチュード7.2の地震が発生しやすいマニラ首都圏の危険性を評価している。これらのツールを活用することで、リスクを包括的に把握し、地域の脆弱性と回復力に関する重要な情報を地域社会に提供することができる。このプロジェクトは、地域とデジタルの知識を統合することで、より安全で備えのある社会が育まれることを例証している。"
  },
  {
    "title": "From Complexity to Clarity: An Intuitive 3D Map Application Development Experience with Cesium and Svelte",
    "date": "2024-12-16",
    "time_range": "16:15-16:30",
    "location": "Auditorium Hall 2",
    "abstract": "This session will explore how combining the powerful 3D mapping capabilities of Cesium with the intuitive and efficient web framework Svelte can simplify the development of 3D map applications. We will demonstrate practical examples, such as data binding and custom stores, to show how these tools can make working with Cesium more straightforward and intuitive. Participants will gain new insights into using Svelte and Cesium together, making complex 3D geospatial projects more accessible and manageable. This session is ideal for frontend engineers looking to enhance their development experience in the growing field of 3D mapping.",
    "description": "Session Overview:\nDeveloping 3D map applications can often be complex and time-consuming. However, by combining Cesium with Svelte, these challenges can be overcome, making the development process more intuitive and efficient. In this session, we will demonstrate how to utilize Svelte's powerful data binding capabilities and custom stores to simplify the development of 3D map applications using Cesium.",
    "speaker": "SUDA",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/XYKJPP/",
    "abstract_ja": "このセッションでは、Cesiumの強力な3Dマッピング機能と、直感的で効率的なWebフレームワークSvelteを組み合わせることで、3D地図アプリケーションの開発をいかに簡素化できるかを探ります。データバインディングやカスタムストアなどの実践的な例を示しながら、これらのツールがCesiumでの作業をより簡単で直感的なものにすることを紹介します。参加者は、SvelteとCesiumを併用することで、複雑な3D地理空間プロジェクトをよりアクセスしやすく、管理しやすくするための新たな洞察を得ることができます。このセッションは、成長著しい3Dマッピング分野での開発経験を強化したいフロントエンドエンジニアに最適です。",
    "description_ja": "セッションの概要\n3D地図アプリケーションの開発は、複雑で時間がかかることがよくあります。しかし、CesiumとSvelteを組み合わせることで、これらの課題を克服し、開発プロセスをより直感的で効率的なものにすることができます。本セッションでは、Svelteの強力なデータバインディング機能とカスタムストアを活用し、Cesiumを使用した3D地図アプリケーションの開発を簡素化する方法をご紹介します。"
  },
  {
    "title": "Development of Large-scale Trip Analysis Toolkits for Vehicle-based GPS Trajectories using Apache Spark and Open Data: A Case Study of Taxis in Bangkok, Thailand",
    "date": "2024-12-16",
    "time_range": "16:15-16:35",
    "location": "Room34-1104",
    "abstract": "Urban planning and mobility analysis have traditionally been studied through observation or questionnaires, which can be time-consuming and costly. However, the rapid advancement of technology has enabled tracking devices to be installed in individual vehicles, allowing the measurement of various values, particularly global positioning system (GPS) signals.",
    "description": null,
    "speaker": "Apichon",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/EUZTM3/",
    "abstract_ja": "都市計画やモビリティの分析は、従来、観察やアンケートによって研究されてきたが、これには時間とコストがかかる。しかし、技術の急速な進歩により、個々の車両に追跡装置が取り付けられるようになり、GPS（全地球測位システム）信号を中心に、さまざまな値を測定できるようになった。"
  },
  {
    "title": "Implementing ETL Processes with NDJSON for Spatial Data Integration",
    "date": "2024-12-16",
    "time_range": "16:30-16:45",
    "location": "Room34-1102",
    "abstract": "Effective data management is essential for maximizing the value of spatial data in today’s data-driven landscape. This presentation provides an overview of implementing ETL (Extract, Transform, Load) processes using NDJSON (Newline Delimited JSON) for efficient spatial data integration. We will discuss the importance of robust data management, the benefits of using NDJSON for handling large and complex spatial datasets, and the practical applications of this approach.",
    "description": "This presentation explores the implementation of ETL (Extract, Transform, Load) processes using NDJSON (Newline Delimited JSON) for effective spatial data integration. We will cover the benefits of NDJSON for handling large and complex spatial datasets, and how it facilitates efficient data processing. Attendees will learn about practical steps for extracting, transforming, and loading spatial data into databases like MongoDB and Elasticsearch, along with real-world use cases and best practices.",
    "speaker": "Athitaya Phankhan",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/VGHKLP/",
    "abstract_ja": "効果的なデータ管理は、今日のデータ主導の状況において空間データの価値を最大化するために不可欠です。このプレゼンテーションでは、効率的な空間データ統合のためにNDJSON（Newline Delimited JSON）を使用したETL（Extract、Transform、Load）プロセスの実装の概要を説明します。堅牢なデータ管理の重要性、大規模で複雑な空間データセットを扱うためにNDJSONを使用する利点、そしてこのアプローチの実用的なアプリケーションについて説明します。",
    "description_ja": "このプレゼンテーションでは、効果的な空間データ統合のためのNDJSON（Newline Delimited JSON）を使用したETL（Extract、Transform、Load）プロセスの実装について説明します。大規模で複雑な空間データセットを扱うためのNDJSONの利点と、効率的なデータ処理を促進する方法について説明します。参加者は、MongoDBやElasticsearchのようなデータベースに空間データを抽出、変換、ロードするための実践的な手順について、実際の使用例やベストプラクティスとともに学びます。"
  },
  {
    "title": "Implementation and visualization of a digital twin system for urban noise prediction",
    "date": "2024-12-16",
    "time_range": "16:30-16:45",
    "location": "Auditorium Hall 2",
    "abstract": "As the maturity of digital twin technology increases over time, there is an increasing demand to implement various services (especially those related to decision support) that utilize invisible phenomena/analysis information by visualizing various types of sensor data or the results of professional analysis/prediction together, from three-dimensional visualization using only buildings/terrain.",
    "description": "The OGC Urban Digital Twin Pilot project behind the announcement aims to develop a web-based digital twin system that integrates urban planning data and noise prediction models to support urban design and decision-making. The system leverages \"the open-source mago 3DTiler and mago 3DTerrainer developed by Gaia3D\" to convert the data into 3D tiles and terrain meshes, which are combined with noise modeler output and visualized in a digital twin. \nThis can be used to assess the compliance of urban designs with noise regulations and help develop noise abatement strategies. In the presentation, we will introduce the system and convey its potential applications for creating better urban environments.",
    "speaker": "Haneul Yoo",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/UKEBWG/",
    "abstract_ja": "デジタルツイン技術の成熟度が高まるにつれ、建物・地形のみによる3次元可視化から、各種センサーデータや専門的な分析・予測結果を合わせて可視化することで、目に見えない現象・分析情報を活用した各種サービス（特に意思決定支援関連）の実現が求められている。",
    "description_ja": "今回の発表の背景にあるOGCアーバンデジタルツインパイロットプロジェクトは、都市設計と意思決定を支援するために、都市計画データと騒音予測モデルを統合したウェブベースのデジタルツインシステムを開発することを目的としている。このシステムは、「Gaia3Dが開発したオープンソースのmago 3DTilerとmago 3DTerrainer」を活用して、データを3Dタイルと地形メッシュに変換し、騒音モデラーの出力と組み合わせてデジタルツインで可視化します。\nこれにより、都市設計の騒音規制への適合性を評価し、騒音軽減戦略の策定に役立てることができます。プレゼンテーションでは、このシステムを紹介し、より良い都市環境を作るための応用の可能性を伝える。"
  },
  {
    "title": "Comparitive Evaluation of Machine Learning Models for Zoning Slope Failure Suceptibility: A Case study of Yen Bai Province, Vietnam",
    "date": "2024-12-16",
    "time_range": "16:30-16:45",
    "location": "Auditorium Hall 1",
    "abstract": "Yen Bai Province in northern Vietnam, especially Mu Cang Chai (MCC) and Van Yen (VY) districts, are highly susceptible to slope failure due to rugged terrain, high rainfall and anthropogenic activities . In this research MCC was used as an area for training and testing the machine learning models, while VY serves for model validation due to similar topographic and geological conditions.",
    "description": null,
    "speaker": "Tran Tung Lam",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/XQWZE9/",
    "abstract_ja": "ベトナム北部のイエンバイ省、特にムーカンチャイ（MCC）地区とヴァン・イェン（VY）地区は、起伏の多い地形、多雨、人為的な活動のため、斜面崩壊の影響を非常に受けやすい。本研究では、MCC地区を機械学習モデルの訓練とテストの対象地区として使用し、VY地区は地形と地質条件が類似していることからモデルの検証に使用した。"
  },
  {
    "title": "Real-Time Monitoring and Positioning of Agricultural Tractors Using a Low-Cost GNSS and IoT Device",
    "date": "2024-12-16",
    "time_range": "16:35-16:55",
    "location": "Room34-1104",
    "abstract": "This research aims to develop a low-cost GNSS receiver device for positioning agricultural tractors, incorporating Differential GPS (DGPS) technology for enhanced accuracy using free and open source software. Integrated with IoT technology, the device was tested to receive GNSS data and other relevant information, including geographic coordinates (latitude and longitude), tractor speed, tractor direction, date, time, and the number of satellites receiving signals. The DGPS setup involves using one receiver as a base station and another on the tractor, where the base station provides correction data to improve positioning accuracy. The data collected by the receiver is transmitted to a signal processing device for mapping the coordinates, creating a route of the tractor's movement that is displayed on a real-time Web Map Application. This process includes error correction to ensure high accuracy. The IoT device was installed on the left rear wheel of the agricultural tractor. Test results show that the data from the developed device has an average accuracy of 22 centimeters, which is acceptable and sufficient for agricultural tractor positioning applications. Furthermore, this system enables real-time monitoring of the tractor's operations.",
    "description": "In the realm of precision agriculture, accurate positioning and real-time monitoring of agricultural machinery are critical for enhancing productivity and efficiency. This study presents a cost-effective solution leveraging a low-cost Global Navigation Satellite System (GNSS) receiver integrated with Internet of Things (IoT) technology for the real-time positioning of agricultural tractors. Utilizing Differential GPS (DGPS) technology, the developed device significantly improves accuracy by using a base station to provide correction data. The system collects comprehensive data, including geographic coordinates, tractor speed and direction, date, time, and satellite signal reception. The data is processed and displayed on a real-time Web Map Application, using GeoServer, Leaflet, PostGIS, geoJSON etc, allowing for detailed mapping and monitoring of tractor movements. The innovative setup achieves an average accuracy of 22 centimeters, making it a viable option for various agricultural applications where precision is paramount. This research showcases the potential of affordable GNSS and IoT solutions in modernizing agricultural practices and optimizing field operations.",
    "speaker": "Thanwamas Phasinam",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/3B3SDZ/",
    "abstract_ja": "本研究の目的は、農業用トラクターの位置測定のための低コストGNSS受信デバイスを開発することであり、フリーでオープンソースのソフトウェアを使用して精度を高めるために差分GPS（DGPS）技術を組み込んだ。IoT技術と統合されたこのデバイスは、GNSSデータとその他の関連情報（地理座標（緯度と経度）、トラクターの速度、トラクターの方向、日付、時刻、信号を受信している衛星の数など）を受信するためにテストされた。DGPSセットアップでは、1台の受信機をベースステーションとして使用し、もう1台をトラクターに搭載し、ベースステーションが補正データを提供して測位精度を向上させる。受信機によって収集されたデータは、座標をマッピングするための信号処理装置に送信され、トラクターの移動経路が作成され、リアルタイムのウェブ地図アプリケーションに表示される。このプロセスには、高い精度を確保するためのエラー補正も含まれている。IoTデバイスは農業用トラクターの左後輪に設置された。テストの結果、開発されたデバイスからのデータの平均精度は22センチメートルで、農業用トラクターの位置決め用途としては許容可能で十分であることが示された。さらに、このシステムはトラクターの作業をリアルタイムで監視することができる。",
    "description_ja": "精密農業の領域では、農業機械の正確な測位とリアルタイムのモニタリングが、生産性と効率の向上に不可欠である。本研究では、農業用トラクターのリアルタイム測位のために、モノのインターネット（IoT）技術と統合された低コストの全地球測位衛星システム（GNSS）受信機を活用した費用対効果の高いソリューションを紹介する。ディファレンシャルGPS（DGPS）技術を活用し、開発したデバイスは、補正データを提供するために基地局を使用することで、精度を大幅に向上させる。システムは、地理座標、トラクターの速度や方向、日付、時刻、衛星信号の受信状況を含む包括的なデータを収集する。データは、GeoServer、Leaflet、PostGIS、geoJSONなどを使用して、リアルタイムのウェブ地図アプリケーション上で処理・表示され、詳細な地図作成とトラクターの動きの監視を可能にします。この革新的なセットアップは、平均22センチの精度を達成し、精度が最も重要な様々な農業用途に実行可能な選択肢となっている。この研究は、農業慣行の近代化と現場作業の最適化における、手頃な価格のGNSSとIoTソリューションの可能性を示している。"
  },
  {
    "title": "From Data to Insights: The Impact of Generative AI on IoT-Based Environmental Monitoring",
    "date": "2024-12-16",
    "time_range": "16:45-17:00",
    "location": "Auditorium Hall 2",
    "abstract": "The integration of Internet of Things (IoT) technology with environmental monitoring systems has significantly enhanced the ability to collect real-time data from diverse and remote locations. However, the challenge lies in efficiently analyzing and interpreting this vast amount of data to make informed decisions. This paper explores the application of generative AI in IoT data analysis for environmental monitoring. Generative AI, with their advanced natural language processing capabilities, offer a novel approach to processing and understanding complex data patterns. By leveraging Generative AI, it is possible to automate the identification of critical environmental changes, predict trends, and provide actionable insights with unprecedented accuracy. This study demonstrates how Generative AI can enhance data analytics in environmental monitoring through case studies that highlight improvements in air quality assessment (e.g. PM 2.5). The findings suggest that Generative AI not only streamline the data analysis process but also enhance the reliability and responsiveness of environmental monitoring systems. Consequently, this research underscores the potential of Generative AI to transform IoT-based environmental monitoring, promoting more proactive and effective environmental management practices.",
    "description": null,
    "speaker": "Dongpo Deng",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/7XHBUA/",
    "abstract_ja": "モノのインターネット（IoT）技術と環境モニタリングシステムの統合により、多様な遠隔地からリアルタイムでデータを収集する能力が大幅に向上した。しかし、この膨大なデータを効率的に分析・解釈し、情報に基づいた意思決定を行うことが課題となっている。本稿では、環境モニタリングのためのIoTデータ分析における生成AIの応用を探る。高度な自然言語処理能力を持つジェネレーティブAIは、複雑なデータ・パターンを処理し理解するための斬新なアプローチを提供する。ジェネレーティブAIを活用することで、重要な環境変化の特定を自動化し、トレンドを予測し、これまでにない精度で実用的な洞察を提供することが可能になる。本研究では、大気質評価（PM2.5など）の改善に焦点を当てたケーススタディを通じて、Generative AIが環境モニタリングにおけるデータ分析をいかに強化できるかを実証する。調査結果は、生成AIがデータ分析プロセスを合理化するだけでなく、環境モニタリングシステムの信頼性と応答性を高めることを示唆している。その結果、この研究は、IoTベースの環境モニタリングを変革し、より積極的で効果的な環境管理を促進するGenerative AIの可能性を強調している。"
  },
  {
    "title": "Catch them young!  Geospatial Capacity building for School Children and Young adults",
    "date": "2024-12-16",
    "time_range": "16:45-17:00",
    "location": "Room34-1102",
    "abstract": "Geospatial technologies are being widely used to address societal needs like land use, demographics, and natural resource management. Spatial data analysis play a crucial role in how we understand and interact with our environment. They involve using maps, GPS, and satellite images to collect, analyse, and display data about the world. Teaching these skills to school children has become increasingly important.",
    "description": null,
    "speaker": "Natraj Vaddadi",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/3M9EKG/",
    "abstract_ja": "地理空間技術は、土地利用、人口統計、天然資源管理などの社会的ニーズに対応するために広く利用されている。空間データ分析は、私たちがどのように環境を理解し、環境と相互作用するかにおいて重要な役割を果たしている。地図、GPS、衛星画像などを使って、世界に関するデータを収集、分析、表示するのである。こうしたスキルを小学生に教えることは、ますます重要になってきている。"
  },
  {
    "title": "PWAGIS QGIS Plugins Development : Lessons learn to Free Open Source Solutions for Geospatial",
    "date": "2024-12-16",
    "time_range": "16:45-17:00",
    "location": "Auditorium Hall 1",
    "abstract": "This talk will explore the transition from proprietary nature to PWAGIS QGIS plugins, focusing on the limitations experienced with previous solutions of proprietary software, the challenges encountered during development, and the innovative functionalities introduced in the new plugins. Attendees will gain insights into the practical aspects of moving from a legacy system to an open-source solution, highlighting both the obstacles and the opportunities this transition presents.",
    "description": "PWA stand for Provincial Waterworks Authoriry in Thailand, it has national wide coverage area by functional. Based on its mission, PWA has to provide clean water for domestic use in the area beyond BMA and vicinity. Of course, mapping technologies was operating over 20 years in GIS department.",
    "speaker": "Prasong Patheepphoemphong",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/8LLDDN/",
    "abstract_ja": "本講演では、プロプライエタリなソフトウェアからPWAGIS QGISプラグインへの移行について、プロプライエタリなソフトウェアの以前のソリューションで経験した制限、開発中に遭遇した課題、新しいプラグインで導入された革新的な機能に焦点を当てながら探ります。参加者は、レガシーシステムからオープンソースソリューションへの移行の実際的な側面について洞察し、この移行がもたらす障害と機会の両方に焦点を当てます。",
    "description_ja": "PWAはタイの地方水道局の略で、機能的に全国をカバーしている。PWAは、その使命に基づき、BMAとその周辺地域以外の地域に、家庭用のきれいな水を供給しなければならない。もちろん、マッピング技術はGIS部門で20年以上稼働している。"
  },
  {
    "title": "On the performance of distributed rendering system for 3DWebGIS application on ultra-high-resolution display",
    "date": "2024-12-16",
    "time_range": "16:55-17:15",
    "location": "Room34-1104",
    "abstract": "Introduction",
    "description": null,
    "speaker": "Tomohiro KAWANABE",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/YZRW9Y/",
    "abstract_ja": "はじめに"
  },
  {
    "title": "ZOO-Project: news about the Open Source Generic Processing Engine",
    "date": "2024-12-16",
    "time_range": "17:00-17:15",
    "location": "Auditorium Hall 1",
    "abstract": "The ZOO-Project is an open-source processing platform released under the MIT/X11 Licence. It provides the polyglot ZOO-Kernel, a server implementation of the Web Processing Service (WPS) (1.0.0 and 2.0.0), and the OGC API - Processes standards published by the OGC. It contains ZOO-Services, a minimal set of ready-to-use services that can be used as a base to create more useful services. It provides the ZOO-API, initially only available from the JavaScript service implementation, which exposes ZOO-Kernel variables and functions to the language used to implement the service. It contains the ZOO-Client, a JavaScript API that can be used from a client application to interact with a WPS server.",
    "description": null,
    "speaker": "Gérald Fenoy",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/DFYYQM/",
    "abstract_ja": "ZOO-Projectは、MIT/X11ライセンスで公開されているオープンソースの処理プラットフォームです。ポリグロットなZOO-Kernel、Web Processing Service (WPS) (1.0.0および2.0.0)のサーバ実装、OGC API - OGCが公開するプロセス標準 - を提供します。ZOO-Servicesは、より有用なサービスを作成するためのベースとして利用できる、すぐに利用できるサービスの最小セットです。ZOO-APIは、当初はJavaScriptのサービス実装からのみ利用可能で、ZOO-Kernelの変数や関数をサービス実装に使用する言語に公開します。ZOO-Clientは、クライアントアプリケーションからWPSサーバーと対話するために使用できるJavaScript APIです。"
  },
  {
    "title": "STAC: Driving Innovation in Geospatial Applications",
    "date": "2024-12-17",
    "time_range": "09:30-09:45",
    "location": "Room34-1102",
    "abstract": "The SpatioTemporal Asset Catalog (STAC) revolutionizes geospatial applications by providing a standardized framework for cataloging spatiotemporal data. Developed in 2017 through a collaborative effort among various organizations, STAC streamlines the discovery and retrieval of geospatial assets, making it easier for users to access satellite imagery and other spatial data. This open-source specification, which aligns with FAIR principles—Findable, Accessible, Interoperable, and Reusable—promotes interoperability among various data providers and applications, fostering innovation in the geospatial community.",
    "description": "Geospatial data, like spatial temporal assets, is a valuable asset for various domains, yet its potential is often hindered by challenges in discovery, access, and interoperability. The SpatioTemporal Asset Catalog (STAC) offers a standardized approach to address these limitations. This presentation will introduce STAC as a framework for describing geospatial data, emphasizing its role in enhancing data findability, accessibility, and usability. By aligning with FAIR principles, STAC facilitates data integration, analysis, and decision-making. A practical demonstration of a STAC catalog and a case study on the GISTDA Disaster Platform will highlight the transformative impact of STAC on geospatial workflows.",
    "speaker": "Siriya Saenkhom-or",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/ANCWCT/",
    "abstract_ja": "時空間アセットカタログ（STAC）は、時空間データをカタログ化するための標準化されたフレームワークを提供することで、地理空間アプリケーションに革命をもたらす。2017年にさまざまな組織の共同作業によって開発されたSTACは、地理空間資産の発見と検索を合理化し、ユーザーが衛星画像やその他の空間データにアクセスしやすくする。FAIRの原則（Findable、Accessible、Interoperable、Reusable）に沿ったこのオープンソース仕様は、さまざまなデータプロバイダやアプリケーション間の相互運用性を促進し、地理空間コミュニティのイノベーションを促進する。",
    "description_ja": "地理空間データは、時空間資産と同様、様々なドメインにとって貴重な資産であるが、その可能性はしばしば発見、アクセス、相互運用性における課題によって妨げられている。時空間アセットカタログ（STAC）は、これらの制限に対処するための標準化されたアプローチを提供する。このプレゼンテーションでは、地理空間データを記述するためのフレームワークとしてSTACを紹介し、データの見つけやすさ、アクセスのしやすさ、使いやすさを向上させる役割を強調する。FAIRの原則に沿うことで、STACはデータの統合、分析、意思決定を促進する。STACカタログの実践的なデモンストレーションとGISTDA災害プラットフォームのケーススタディにより、地理空間ワークフローにおけるSTACの変革的な影響を強調する。"
  },
  {
    "title": "SERVIR Southeast Asia Biophysical M&E Dashboard: A Tool to Support Landscape Monitoring",
    "date": "2024-12-17",
    "time_range": "09:30-09:45",
    "location": "Auditorium Hall 2",
    "abstract": "Environmental degradation in Southeast Asia, particularly in Cambodia, is an alarming issue that poses significant threats to both ecosystems and human well-being. The region is experiencing rapid deforestation driven by agricultural expansion and urban development, leading to substantial loss of forest cover. This deforestation disrupts ecological balance and biological environments, contributing to habitat fragmentation, biodiversity loss, and alterations in local microclimates. Concurrently, changes in land use and land cover exacerbate these problems, further fragmenting habitats and impacting species distribution. The increasing risk of forest fires, fueled by climate variability, land use changes, and agricultural burning, adds another layer of concern, contributing to air pollution and posing risks to both natural and human systems.",
    "description": null,
    "speaker": "MD KAMAL HOSEN",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/S9J8W3/",
    "abstract_ja": "東南アジア、特にカンボジアにおける環境悪化は、生態系と人間の福利の両方に重大な脅威をもたらす憂慮すべき問題である。この地域では、農業の拡大や都市開発によって森林の減少が急速に進み、森林被覆が大幅に失われている。この森林伐採は生態系のバランスと生物学的環境を破壊し、生息地の分断、生物多様性の損失、地域の微気候の変化を引き起こしている。同時に、土地利用と土地被覆の変化がこれらの問題を悪化させ、生息地をさらに分断し、種の分布に影響を与えている。気候変動、土地利用の変化、農地の焼畑によって引き起こされる森林火災のリスクの増大は、大気汚染の一因となり、自然と人間の両方のシステムにリスクをもたらす。"
  },
  {
    "title": "JSON Style Map: Enhancing Flexibility and Efficiency in Map Data Visualization",
    "date": "2024-12-17",
    "time_range": "09:30-09:45",
    "location": "Auditorium Hall 1",
    "abstract": "In today's rapidly evolving field of map data visualization, the use of vector tiles is increasingly prevalent. Vector tiles offer flexible and efficient data display, but they require JSON Style data to define their visual representation. JSON Style plays a crucial role in formatting data, ensuring that presentations are both diverse and user-friendly.",
    "description": "JSON Style is essential in online map data visualization due to its ability to effectively control the display of complex data. This includes capabilities such as altering colors, setting sizes, and arranging elements. With JSON Style, designers and developers can swiftly and easily create and modify visualizations to meet specific requirements.\nDeveloped to streamline the management and customization of web application appearances, JSON Style empowers designers and developers to maintain consistent and appealing visual presentations that align with user preferences and needs. This tool enables adjustments to various styles, including background colors, fonts, font sizes, button designs, and other elements. Users can create, save, and apply their custom styles to different parts of the application as required.\nMoreover, JSON Style facilitates efficient team collaboration in style development and maintenance, making the application development process smoother and allowing for continuous style improvements. This tool effectively addresses the needs of both development teams and end-users.\nThe flexibility and efficiency of JSON Style in defining visual representations have made it an indispensable tool. It enables designers and developers to produce visually appealing and user-centric online map data visualizations, contributing to its widespread acceptance and popularity in the fields of mapping and web application development.",
    "speaker": "PEERANAT PRASONGSUK",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/MLEYUT/",
    "abstract_ja": "地図データのビジュアライゼーションが急速に発展している今日、ベクトル・タイルの使用はますます普及しています。ベクトル タイルは柔軟で効率的なデータ表示を提供しますが、その視覚的表現を定義するために JSON スタイル データが必要です。JSON スタイルは、データの書式設定において重要な役割を果たし、プレゼンテーションの多様性とユーザーフレンドリーを実現します。",
    "description_ja": "JSONスタイルは、複雑なデータの表示を効果的に制御できるため、オンライン地図データの視覚化には不可欠です。これには、色の変更、サイズの設定、要素の配置などの機能が含まれます。JSON Style を使用することで、デザイナーや開発者は、特定の要件を満たすビジュアライゼーションを迅速かつ簡単に作成、変更することができます。\nウェブ アプリケーションの外観の管理とカスタマイズを合理化するために開発された JSON Style を使用することで、デザイナーと開発者は、ユーザーの好みやニーズに合わせて、一貫性のある魅力的なビジュアル プレゼンテーションを維持することができます。このツールは、背景色、フォント、フォントサイズ、ボタンデザイン、その他の要素を含む様々なスタイルの調整を可能にします。ユーザーはカスタムスタイルを作成、保存し、必要に応じてアプリケーションのさまざまな部分に適用することができます。\nさらに、JSON スタイルは、スタイル開発とメンテナンスにおける効率的なチームコラボレーションを促進し、アプリケーション開発プロセスをスムーズにし、継続的なスタイル改善を可能にします。このツールは、開発チームとエンドユーザーの両方のニーズに効果的に対応します。\nJSON Styleは、ビジュアル表現の定義における柔軟性と効率性により、必要不可欠なツールとなっています。デザイナーや開発者は、視覚的に魅力的でユーザー中心のオンライン地図データビジュアライゼーションを作成できるため、マッピングやウェブアプリケーション開発の分野で広く受け入れられ、人気を博しています。"
  },
  {
    "title": "Predictive Analysis of LULC Dynamics for Area Under Submergence and its Environmental Impacts for the Mekedatu Reservoir Project",
    "date": "2024-12-17",
    "time_range": "09:30-09:45",
    "location": "Room34-1104",
    "abstract": "Reservoirs play a crucial role in global water resource management, hydroelectric power generation, and flood control. However, their construction often entails significant ecological and socio-economic impacts, necessitating thorough environmental assessments. The Mekedatu Reservoir Project, situated on the Cauvery River in the Ramanagar district of Karnataka, India, holds paramount significance. Aimed at supplying the Bengaluru Metropolitan Region and its surroundings with drinking water, the project also endeavors to generate 400 MW of renewable energy annually. Despite its benefits, the project comes with ecological costs, as approximately 5252.40 hectares of revenue, forest, and wildlife land will be submerged. This necessitates a detailed evaluation of its potential environmental consequences.",
    "description": null,
    "speaker": "CHANDAN M C",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/DWYGFU/",
    "abstract_ja": "貯水池は、世界の水資源管理、水力発電、洪水調節において重要な役割を果たしている。しかし、その建設には生態学的、社会経済的に大きな影響が伴うことが多く、徹底的な環境アセスメントが必要である。メケダツ貯水池プロジェクトは、インド・カルナタカ州ラマナガル県のカウヴェリー川に位置し、その重要性は極めて高い。このプロジェクトは、ベンガルール首都圏とその周辺地域に飲料水を供給することを目的としており、年間400MWの再生可能エネルギーの発電にも取り組んでいる。その利点とは裏腹に、このプロジェクトには生態学的コストが伴う。約5252.40ヘクタールの収入、森林、野生生物の土地が水没することになるからだ。そのため、潜在的な環境への影響を詳細に評価する必要がある。"
  },
  {
    "title": "Multi-Class Oil Palm Tree Detection from UAV Imagery Using Deep Learning",
    "date": "2024-12-17",
    "time_range": "09:45-10:00",
    "location": "Room34-1104",
    "abstract": "Southeast Asia (SEA) region leads the world in palm oil production, with Indonesia, Malaysia, and Thailand collectively contributing over 88% of the global production. However, the tropical climate in the SEA region resulted in oil palm trees vulnerable to various diseases such as Fatal Yellowing (FY) and Ganoderma boninense. To keep track of productivity, it is crucial to monitor the varying conditions of oil palm trees—such as healthy, dead, yellow, and small—and apply effective pruning techniques to cure affected trees. Manual approach for oil palm tree detection is expensive, tedious, and prone to inaccuracies. Thus, our study is focused to automate the detection of oil palm trees and their states using a deep learning (DL) algorithm on unmanned aerial vehicle (UAV) imagery. We use YOLOv8, one of the latest open-source models, on the publicly available UAV dataset, named MOPAD, containing training and validation sets. The performance of the model is further compared with other state-of-the-art object detectors. In addition, a prototype web application is developed to demonstrate the robustness of the model in adverse real-world conditions and for potential deployment.",
    "description": null,
    "speaker": "Aakash Thapa",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/TSAVMQ/",
    "abstract_ja": "東南アジア（SEA）地域はパーム油生産で世界をリードしており、インドネシア、マレーシア、タイを合わせると世界生産の88％以上を占めている。しかし、SEA地域の熱帯気候のため、アブラヤシの木は致命的黄化病（FY）や霊芝（Ganoderma boninense）などの様々な病気に弱い。生産性を維持するためには、アブラヤシの木が健全か、枯れているか、黄色くなっているか、小さくなっているかなど、さまざまな状態を監視し、罹患した木を治療するために効果的な剪定技術を適用することが極めて重要です。手作業によるアブラヤシの木の検出は、高価で、面倒で、不正確になりやすい。そこで、本研究では、無人航空機（UAV）の画像上でディープラーニング（DL）アルゴリズムを使用して、アブラヤシの木とその状態を自動検出することに焦点を当てている。最新のオープンソースモデルの1つであるYOLOv8を、訓練セットと検証セットを含む、MOPADと名付けられた一般公開されているUAVデータセット上で使用する。さらに、このモデルの性能を他の最先端の物体検出器と比較する。さらに、プロトタイプのウェブアプリケーションを開発し、実世界の悪条件下におけるモデルの頑健性を実証し、潜在的な配備の可能性を示す。"
  },
  {
    "title": "Geospatial climate and environmental monitoring for health surveillance",
    "date": "2024-12-17",
    "time_range": "09:45-10:00",
    "location": "Auditorium Hall 2",
    "abstract": "Introduction/Background:\nThe consequences of climate and environmental changes on health are now obvious to communities, institutions and researchers alike. The impact of these changes must now be considered in an operational way in health management, in order to anticipate their effects, prevent them or mitigate them where possible. In practice, there is very little routine real-time use of space observation data in the public health sector, despite the increasing availability of space data. Indeed, space observation technologies have been constantly evolving since the 1970s, and now offer a wide range of data at different spatial, temporal and radiometric resolutions. More recently, access to data acquired by satellite has greatly improved, with free, massive data and easier processing. This offers the possibility of supporting health surveillance at various scales, which will be explored in this presentation using different examples from South-East Asia.",
    "description": null,
    "speaker": "Vincent HERBRETEAU",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/BFP8PP/",
    "abstract_ja": "はじめに／背景\n気候や環境の変化が健康に及ぼす影響は、今や地域社会、医療機関、研究者のいずれにとっても明らかである。このような変化の影響を予測し、可能な限り予防・緩和するために、健康管理における運用面で考慮する必要がある。実際には、宇宙観測データの利用可能性が高まっているにもかかわらず、公衆衛生分野で宇宙観測データを日常的にリアルタイムで利用することはほとんどない。実際、宇宙観測技術は1970年代から絶え間なく進化しており、現在ではさまざまな空間的、時間的、放射学的解像度で幅広いデータを提供している。さらに最近では、衛星によって取得されたデータへのアクセスが大幅に改善され、無料で膨大なデータを入手でき、処理も容易になった。このことは、様々な規模での健康監視をサポートする可能性を提供するものであり、本プレゼンテーションでは、東南アジアの様々な例を用いて、その可能性を探る。"
  },
  {
    "title": "SERVIR Southeast Asia Air Quality Explorer: A Tool Harnessing Satellite and Modeling Data for Pollutant Monitoring in the Region",
    "date": "2024-12-17",
    "time_range": "09:45-10:00",
    "location": "Auditorium Hall 1",
    "abstract": "Air pollution in Southeast Asia has reached critical levels, significantly impacting human health across the region. Nearly the entire population lives in areas where air pollution exceeds the World Health Organization’s (WHO) safe air standards. This severe pollution is primarily due to rapid industrialization, urbanization, and deforestation, which have increased the amount of harmful pollutants in the air, particularly fine particulate matter known as PM2.5. Seasonal agricultural burning, a common practice in the region, also contributes significantly by releasing large quantities of smoke and particulate matter into the air. The rapid pace of urbanization has led to increased vehicle emissions and construction activities, further degrading air quality.",
    "description": null,
    "speaker": "Thannarot Kunlamai",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/CTJAG8/",
    "abstract_ja": "東南アジアの大気汚染は危機的なレベルに達しており、地域全体の人々の健康に大きな影響を与えている。ほぼ全人口が、世界保健機関（WHO）の安全大気基準を上回る大気汚染の地域に住んでいる。この深刻な汚染は、急速な工業化、都市化、森林伐採が主な原因で、大気中の有害汚染物質、特にPM2.5と呼ばれる微小粒子状物質の量が増加している。また、この地域でよく見られる季節的な農作物の焼畑も、大量の煙と粒子状物質を大気中に放出し、大きな原因となっている。都市化の急速な進展は、自動車の排気ガスや建設活動の増加につながり、大気の質をさらに悪化させている。"
  },
  {
    "title": "Design and Deploy Microservice for GIS Application apply OGC Standard",
    "date": "2024-12-17",
    "time_range": "09:45-10:00",
    "location": "Room34-1102",
    "abstract": "In the past, the installation of GIS applications often encountered challenges regarding the flexibility of services, which were unable to be scaled to accommodate a growing number of users. The interconnection and exchanging of data across services were constrained, and service separation was not feasible. These issues had a significant impact on overall usability.",
    "description": null,
    "speaker": "Worrathep Somboonrungrod",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/C9LSPS/",
    "abstract_ja": "かつて、GISアプリケーションのインストールは、サービスの柔軟性に関してしばしば課題に直面し、ユーザー数の増加に合わせて拡張することができなかった。サービス間の相互接続やデータ交換には制約があり、サービスの分離は実現不可能でした。これらの問題は、全体的な使い勝手に大きな影響を及ぼしていた。"
  },
  {
    "title": "Sen2Extract: A Free Online Tool to Access Environmental Index Time Series from Sentinel 2",
    "date": "2024-12-17",
    "time_range": "10:00-10:15",
    "location": "Auditorium Hall 2",
    "abstract": null,
    "description": "Since the European Space Agency Copernicus’s launch of the Sentinel satellites in 2015, there has been a rising interest in adapting free and high-quality geospatial data to inform scientific research. Of particular interest are environmental indices from Sentinel 2 (e.g. NDVI, MNDWI) which can be utilized for analysis and modelling in various topics in health, agriculture, and biodiversity.",
    "speaker": "George Ge",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/WN8GE7/",
    "description_ja": "2015年に欧州宇宙機関コペルニクスがセンチネル衛星を打ち上げて以来、科学研究に情報を提供するために無料で高品質な地理空間データを活用することへの関心が高まっている。特に注目されているのは、健康、農業、生物多様性など様々なトピックの分析やモデリングに活用できるセンチネル2からの環境指標（NDVI、MNDWIなど）である。"
  },
  {
    "title": "Hyperspectral Remote Sensing Data Analysis for Oil Palm and Nipa Palm Plantation Using EnMAP-Box open-source plugin on QGIS",
    "date": "2024-12-17",
    "time_range": "10:00-10:15",
    "location": "Room34-1104",
    "abstract": "Spaceborne hyperspectral data can assist in estimating crop yields, predicting crop outcomes, and monitoring crops, which ultimately contributes to loss prevention and food security. Recently, EnMAP hyperspectral imagery has become available, starting from 2022. This study aims to analyze and classify oil palm and nipa palm plantations using hyperspectral images combined with machine learning algorithms. The Random Forest classifier, CatBoost classifier, and LightGBM classifier were utilized to automatically map the oil palm and nipa palm areas. The fully workflows of the hyperspectral imaging process were performed in EnMAP-Box plugin on QGIS software. The overall accuracy of three ML classfiers provides greater than 90% especially in oil palm and nipa palm plantations. Machine learning can find out the hidden information about spectral characteristics.",
    "description": "This study utilized hyperspectral imagery from the Environmental Mapping and Analysis Program (EnMAP) by the German Space Agency to classify oil palm and nipa palm plantations using three different machine learning methods. We also analyzed the spectral characteristics of various palms using spaceborne images with a 30-meter spatial resolution and 224 spectral bands, including VNIR and SWIR (420-2450 nm). The EnMAP images, available as free open data since 2022, were acquired through https://www.enmap.org/. The EnMAP hyperspectral data were visualized and processed using the EnMAP-Box, a free and open-source plug-in for QGIS. This plug-in offers several algorithms for processing high-dimensional imagery, such as band selection, dimensionality reduction, classification, and regression.",
    "speaker": "Jirawat Daraneesrisuk",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/S8VH7C/",
    "abstract_ja": "宇宙からのハイパースペクトルデータは、農作物の収量の推定、農作物の結果の予測、農作物のモニタリングに役立ち、最終的には損失防止と食糧安全保障に貢献する。最近、EnMAPハイパースペクトル画像が2022年から利用できるようになった。本研究の目的は、ハイパースペクトル画像と機械学習アルゴリズムを組み合わせて、アブラヤシとニッパヤシのプランテーションを分析・分類することである。ランダムフォレスト分類器、CatBoost分類器、LightGBM分類器を利用して、アブラヤシとニッパヤシの植林地を自動的にマッピングした。ハイパースペクトル画像処理の完全なワークフローは、QGISソフトウェア上のEnMAP-Boxプラグインで実行された。3つのML分類器の総合的な精度は、特にアブラヤシとニッパヤシのプランテーションにおいて90％以上であった。機械学習は、スペクトル特性に関する隠れた情報を見つけることができる。",
    "description_ja": "本研究では、ドイツ宇宙庁のEnvironmental Mapping and Analysis Program（EnMAP）のハイパースペクトル画像を利用し、3つの異なる機械学習法を用いてアブラヤシとニッパヤシのプランテーションを分類した。また、30メートルの空間分解能と、VNIRとSWIR（420～2450nm）を含む224のスペクトルバンドを持つスペースボーン画像を用いて、様々なヤシのスペクトル特性を分析した。EnMAP画像は、2022年から無料のオープンデータとして利用可能で、https://www.enmap.org/。EnMAPハイパースペクトルデータは、QGIS用のフリーでオープンソースのプラグインであるEnMAP-Boxを使って可視化され処理された。このプラグインは、バンド選択、次元削減、分類、回帰など、高次元画像を処理するためのいくつかのアルゴリズムを提供している。"
  },
  {
    "title": "Scrollytelling the 53 Stations of Tōkaidō: An Interactive Journey Through Japan’s Historic Route",
    "date": "2024-12-17",
    "time_range": "10:00-10:15",
    "location": "Auditorium Hall 1",
    "abstract": null,
    "description": "The 53 Stations of the Tōkaidō (東海道五十三次, Tōkaidō Gojūsan-tsugi) are iconic rest areas along the historic coastal road that once connected modern-day Tokyo to Kyoto. This route is renowned for its Ukiyo-e (浮世絵) prints, a distinctive form of Japanese painting that flourished during the Edo period from the 17th to the 19th centuries.",
    "speaker": "Sorami Hisamoto",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/HGLKZM/",
    "description_ja": "東海道五十三次（とうかいどうごじゅうさんつぎ）は、かつて現在の東京と京都を結んでいた歴史的な街道沿いの象徴的な休憩所である。このルートは、浮世絵で有名である。浮世絵は、17世紀から19世紀にかけて江戸時代に栄えた日本画の独特の形式である。"
  },
  {
    "title": "Server-Side and Client-Side Topology rule-based by python from Provincial Waterworks Authority",
    "date": "2024-12-17",
    "time_range": "10:00-10:15",
    "location": "Room34-1102",
    "abstract": "Geospatial Topology, a fundamental concept in geographic information systems, focuses on the analysis and characterization of spatial relationships between geographic entities without alteration of their intrinsic properties. This presentation examines the implementation of Geospatial Topology rules utilizing Python programming language, facilitating execution in both client-side and server-side environments.\nWe present an empirical case study from the PWA GIS Department of Thailand, which employs a comprehensive set of over 30 topology rule-based validations to ensure data integrity and consistency across national cartographic operations. The research investigates two primary platforms: QGIS Desktop and Web Applications, both serving as client-side interfaces capable of executing topology scripts and generating inconsistency reports for subsequent rectification.\nA critical distinction between QGIS Desktop and Web Application lies in their respective execution paradigms: QGIS Desktop operates within a local environment, while the Web Application leverages server-side processing capabilities. \nThis presentation will elucidate methodologies for developing custom topology rules and demonstrate techniques for accessing single-algorithm Python scripts across both Desktop and Web Application environments. By bridging the technological gap between these platforms, we aim to enhance the efficacy of geospatial data quality control processes and optimize GIS workflows.\nThe findings of this research contribute to the broader understanding of cross-platform geospatial topology implementation and offer practical insights for GIS professionals and developers seeking to improve data validation processes in diverse computational environments.",
    "description": null,
    "speaker": "PEERANAT PRASONGSUK",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/EKNY9X/",
    "abstract_ja": "地理情報システムの基本的な概念である地理空間トポロジーは、地理エンティティ間の空間的関係を、その本質的な特性を変えることなく分析し、特徴付けることに焦点を当てている。本発表では、Pythonプログラミング言語を利用した地理空間トポロジールールの実装について検討し、クライアントサイドとサーバーサイドの両方の環境での実行を容易にする。\nタイのPWA GIS Departmentの実証的なケーススタディを紹介し、30以上のトポロジールールに基づく包括的な検証セットを採用することで、国全体の地図作成業務におけるデータの整合性と一貫性を確保する。この研究では、2つの主要なプラットフォームを調査している：QGIS DesktopとWebアプリケーションであり、どちらもトポロジースクリプトを実行し、その後の修正のために不整合レポートを生成するクライアント側のインターフェースとして機能する。\nQGIS DesktopとWebアプリケーションの決定的な違いは、それぞれの実行パラダイムにある：QGIS Desktopはローカル環境で動作し、Webアプリケーションはサーバーサイドの処理機能を活用します。\nこのプレゼンテーションでは、カスタムのトポロジールールを開発するための方法論を明らかにし、Desktop と Web アプリケーションの両方の環境で単一アルゴリズムの Python スクリプトにアクセスするテクニックを紹介します。これらのプラットフォーム間の技術ギャップを埋めることで、地理空間データの品質管理プロセスの有効性を高め、GISワークフローを最適化することを目指す。\n本研究の成果は、クロスプラットフォームの地理空間トポロジーの実装に関する幅広い理解に貢献し、多様な計算環境におけるデータ検証プロセスの改善を目指すGIS専門家や開発者に実用的な洞察を提供する。"
  },
  {
    "title": "Expectation Testing for Web Map Applications",
    "date": "2024-12-17",
    "time_range": "10:15-10:30",
    "location": "Auditorium Hall 1",
    "abstract": "A part of the web map application, ensuring functionality and accuracy is paramount to delivering a reliable user experience. This abstract outlines a systematic approach to expectation testing for web maps, focusing on validating that these applications meet predefined criteria and user expectations.",
    "description": null,
    "speaker": "Parichat Namwichian",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/NJXT8V/",
    "abstract_ja": "ウェブ地図アプリケーションの一部である機能性と正確性を保証することは、信頼できるユーザー体験を提供するために最も重要である。このアブストラクトでは、ウェブマップの期待値テストに対する体系的なアプローチを概説し、これらのアプリケーションが事前に定義された基準とユーザーの期待値を満たしていることを検証することに焦点を当てる。"
  },
  {
    "title": "Visualizing and Managing Smart Grids with Geospatial Big Data: The SEMS Approach",
    "date": "2024-12-17",
    "time_range": "10:15-10:30",
    "location": "Room34-1102",
    "abstract": "Geospatial big data plays a pivotal role in the context of smart grids, revolutionizing the way modern electrical grids are monitored, managed, and optimized. Smart grids integrate advanced sensing, communication, and control technologies to enhance the efficiency, reliability, and sustainability of electricity distribution. While locational information of the smart meters is pivotal, the consumption patterns combined with other information like consumer type, land use and local weather conditions can really enhance the assessment of energy requirements and usage thus leading to a Spatial Energy Management System (SEMS). This will significantly enrich location-aware decision-making, real-time monitoring, and predictive analysis, thus improving energy resource optimisation and achieving the goal of SDG-7. The SEMS web application represents a critical advancement, facilitating dynamic visualization of temporal clusters, across energy sources and their evolution over time. By overlaying clusters across different time periods, utility personnel gain insights into customer categorizations vs actual utilization, enabling understanding of demand fluctuations, outages and faults, fault localization within the electric network and demand-generation assessment of renewable energy. \nThe primary objective is the development of a dynamic web-based SEMS application capable of visualizing temporal changes and consumption patterns, while also providing alerts to facilitate proactive management.",
    "description": "Geospatial big data plays a pivotal role in the context of smart grids, revolutionizing the way modern electrical grids are monitored, managed, and optimized. Smart grids integrate advanced sensing, communication, and control technologies to enhance the efficiency, reliability, and sustainability of electricity distribution. While locational information of the smart meters is pivotal, the consumption patterns combined with other information like consumer type, land use and local weather conditions can really enhance the assessment of energy requirements and usage thus leading to a Spatial Energy Management System (SEMS). This will significantly enrich location-aware decision-making, real-time monitoring, and predictive analysis, thus improving energy resource optimisation and achieving the goal of SDG-7. The SEMS web application represents a critical advancement, facilitating dynamic visualization of temporal clusters, across energy sources and their evolution over time. By overlaying clusters across different time periods, utility personnel gain insights into customer categorizations vs actual utilization, enabling understanding of demand fluctuations, outages and faults, fault localization within the electric network and demand-generation assessment of renewable energy. \nThe primary objective is the development of a dynamic web-based SEMS application capable of visualizing temporal changes and consumption patterns, while also providing alerts to facilitate proactive management.",
    "speaker": "Venkata Satya Rama Rao Bandreddi",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/DTYBZN/",
    "abstract_ja": "地理空間ビッグデータは、スマートグリッドの文脈で極めて重要な役割を果たし、現代の電力網を監視、管理、最適化する方法に革命をもたらしている。スマートグリッドは、高度なセンシング、通信、制御技術を統合し、配電の効率性、信頼性、持続可能性を高める。スマートメーターの位置情報は極めて重要であるが、消費パターンを消費者のタイプ、土地利用、地域の気象条件などの他の情報と組み合わせることで、エネルギー要件と使用量の評価を強化することができ、空間エネルギー管理システム（SEMS）につながる。これにより、場所を意識した意思決定、リアルタイムのモニタリング、予測分析が大幅に強化され、エネルギー資源の最適化が改善され、SDG-7の目標が達成される。SEMSのウェブ・アプリケーションは、エネルギー源の時間的なクラスターとその経年変化をダイナミックに可視化する、重要な進歩である。異なる時間帯のクラスターを重ね合わせることで、電力会社の担当者は顧客の分類と実際の利用状況を比較し、需要変動、停電、故障を理解し、電気ネットワーク内の故障箇所を特定し、再生可能エネルギーの需要生成評価を行うことができます。\n主な目的は、動的なウェブベースのSEMSアプリケーションを開発し、時間的変化と消費パターンを視覚化することである。",
    "description_ja": "地理空間ビッグデータは、スマートグリッドの文脈で極めて重要な役割を果たし、現代の電力網を監視、管理、最適化する方法に革命をもたらしている。スマートグリッドは、高度なセンシング、通信、制御技術を統合し、配電の効率性、信頼性、持続可能性を高める。スマート・メーターの位置情報は極めて重要だが、消費パターンを消費者のタイプ、土地利用、地域の気象条件など他の情報と組み合わせることで、エネルギー要件と使用量の評価を強化し、空間エネルギー管理システム（SEMS）につなげることができる。これにより、場所を意識した意思決定、リアルタイムのモニタリング、予測分析が大幅に強化され、エネルギー資源の最適化が改善され、SDG-7の目標が達成される。SEMSのウェブ・アプリケーションは、エネルギー源の時間的なクラスターとその経年変化をダイナミックに可視化する、重要な進歩である。異なる時間帯のクラスターを重ね合わせることで、電力会社の担当者は顧客の分類と実際の利用状況を比較し、需要変動、停電、故障を理解し、電気ネットワーク内の故障箇所を特定し、再生可能エネルギーの需要生成評価を行うことができます。\n主な目的は、動的なウェブベースのSEMSアプリケーションを開発し、時間的変化と消費パターンを視覚化することである。"
  },
  {
    "title": "GeoCambodia: A web application to visualize Cambodia Then and Now through aerial photographs and satellite images.",
    "date": "2024-12-17",
    "time_range": "10:15-10:30",
    "location": "Auditorium Hall 2",
    "abstract": "The French National Geographic Institute (IGN) came to Cambodia between 1952 and 1954 to carry out a large-scale photographic project, taking around 11,000 aerial images over a large part of the country.",
    "description": "GeoCambodia.org is a web application to visualize Cambodia then and now, equipped with a user-friendly interface that includes an interactive slider to navigate and compare the old 1953 and 1993 aerial orthophotographs with the recent Google Earth images. Also, vector outlines of buildings from 1993, produced by the Atelier Parisien d’Urbanisme (APUR), have been integrated to enable visitors to click on a building and view the APUR’s descriptive architectural sheets. Other functions and the extension of the aerial images to the whole of Cambodia are still to come in this interface.",
    "speaker": "Chamroeun YORNGSOK",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/3HL8X9/",
    "abstract_ja": "フランスのナショナルジオグラフィック研究所（IGN）は、1952年から1954年にかけてカンボジアを訪れ、国土の大部分を空撮し、約1万1000枚の写真を撮影するという大規模な写真プロジェクトを実施した。",
    "description_ja": "GeoCambodia.orgは、カンボジアの昔と今を視覚化するウェブアプリケーションで、1953年と1993年の古い航空正射写真と最近のGoogle Earth画像をナビゲートして比較できるインタラクティブなスライダーを含む、ユーザーフレンドリーなインターフェイスを備えている。また、Atelier Parisien d'Urbanisme (APUR)によって作成された1993年の建物のベクターアウトラインが統合され、訪問者は建物をクリックしてAPURの説明的な建築シートを見ることができる。その他の機能やカンボジア全土への航空画像の拡張は、このインターフェイスにまだ残っている。"
  },
  {
    "title": "kari-sdm: Advanced Species Distribution Modeling using PyTorch and scikit-learn",
    "date": "2024-12-17",
    "time_range": "10:15-10:30",
    "location": "Room34-1104",
    "abstract": "Species Distribution Modeling (SDM) is a statistical methodology used to predict the spatial and temporal distribution of species based on environmental conditions that are conducive to their survival and reproduction. This modeling approach leverages spatially explicit species occurrence records alongside various environmental covariates, including climate, terrain, and land cover, as input variables, with the aim of quantifying and mapping species-environment interactions. SDM has become a critical tool in ecological research and conservation biology for understanding and predicting species distribution patterns. A range of machine learning and deep learning techniques can be employed in SDM, such as Logistic Regression (LR), Random Forest (RF), Multilayer Perceptron (MLP), Convolutional Neural Network (CNN), and Generative Adversarial Network-CNN (GAN-CNN). Despite the availability of these techniques, there is a lack of a comprehensive application that integrates these algorithms for species distribution modeling. To address this gap, this paper introduces a new tool, kari-sdm, which enables users to perform SDM utilizing a variety of techniques. Kari-sdm supports LR, RF, MLP, CNN, and GAN-CNN algorithms, all based on open-source frameworks PyTorch and scikit-learn. Additionally, it facilitates all necessary preprocessing steps, from data collection, cleaning, transformation, spatial preprocessing, and environmental variable selection, to data splitting. The tool also provides functions for model evaluation, result visualization, and cross-validation. The primary goal of kari-sdm is to assist ecologists in modeling species distributions, interpreting results, and developing informed conservation and management strategies.",
    "description": "The kari-sdm tool is a versatile and comprehensive software solution designed for Species Distribution Modeling (SDM). It integrates multiple machine learning and deep learning algorithms, including Logistic Regression, Random Forest, Multilayer Perceptron, Convolutional Neural Network, and Generative Adversarial Network-CNN. Built on open-source frameworks PyTorch and scikit-learn, kari-sdm facilitates the entire modeling workflow, from data preprocessing to model evaluation and result visualization. This tool is specifically designed to support ecologists in understanding species-environment interactions and developing effective conservation strategies.",
    "speaker": "Lee, Jeongho",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/UUUPDK/",
    "abstract_ja": "種分布モデリング（SDM）は、種の生存と繁殖に適した環境条件に基づいて、種の空間的・時間的分布を予測するために用いられる統計的手法である。このモデリング手法は、空間的に明示された種の出現記録と、気候、地形、土地被覆などの様々な環境共変数を入力変数として活用し、種と環境の相互作用を定量化・マッピングすることを目的としている。SDMは生態学研究や保全生物学において、種の分布パターンを理解し予測するための重要なツールとなっている。SDMでは、ロジスティック回帰（LR）、ランダムフォレスト（RF）、多層パーセプトロン（MLP）、畳み込みニューラルネットワーク（CNN）、生成逆数ネットワーク-CNN（GAN-CNN）など、さまざまな機械学習や深層学習の技術を採用することができる。これらの技術が利用可能であるにもかかわらず、種の分布モデリングのためにこれらのアルゴリズムを統合した包括的なアプリケーションが不足している。このギャップを解決するために、本論文では、様々な手法を利用してSDMを実行できる新しいツールkari-sdmを紹介する。kari-sdmは、オープンソースのフレームワークであるPyTorchとscikit-learnをベースとしたLR、RF、MLP、CNN、GAN-CNNアルゴリズムをサポートしています。さらに、データ収集、クリーニング、変換、空間的前処理、環境変数の選択からデータ分割まで、必要なすべての前処理ステップを容易にします。このツールはまた、モデル評価、結果の可視化、クロスバリデーションの機能も提供する。kari-sdmの主な目的は、生態学者による種の分布のモデル化、結果の解釈、情報に基づいた保全・管理戦略の策定を支援することです。",
    "description_ja": "kari-sdmツールは、種分布モデリング（SDM）のために設計された汎用性の高い包括的なソフトウェアソリューションです。Logistic Regression、Random Forest、Multilayer Perceptron、Convolutional Neural Network、Generative Adversarial Network-CNNなど、複数の機械学習および深層学習アルゴリズムを統合しています。オープンソースのフレームワークであるPyTorchとscikit-learnをベースに構築されたkari-sdmは、データの前処理からモデルの評価、結果の可視化まで、モデリングのワークフロー全体を容易にします。このツールは、種と環境の相互作用を理解し、効果的な保全戦略を開発する生態学者を支援するために特別に設計されています。"
  },
  {
    "title": "Enjoying Delicious Meals Using MapLibre: A Journey into Developing a MapLibre Module",
    "date": "2024-12-17",
    "time_range": "11:00-11:15",
    "location": "Auditorium Hall 2",
    "abstract": "In this session, I will introduce a module I developed for clustering icon image markers using MapLibre, with the theme of \"finding nearby restaurants that look delicious.\" This is the first module I’ve ever created, and it’s designed with a very simple structure. Through this session, I hope participants will take away two key messages: that creating what you want to make is enjoyable, and that even if you’re not highly skilled, sharing your work can lead to valuable learning experiences.",
    "description": "Delicious meals bring joy and vitality to our lives. However, finding nearby restaurants that offer mouth-watering dishes can sometimes be a bit tricky. In this session, we will explore how to leverage the power of MapLibre to simplify and enhance the process of discovering great places to eat. Whether you love MapLibre, are interested in module development, or simply enjoy good food, this session is for you. Come and join us on this delicious journey!",
    "speaker": "Shinsuke Nakamori",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/9WESSG/",
    "abstract_ja": "このセッションでは、\"美味しそうな近くのレストランを探す \"というテーマで、MapLibreを使ってアイコン画像マーカーをクラスタリングするために開発したモジュールを紹介します。このモジュールは私が初めて作成したもので、とてもシンプルな構造になっています。このセッションを通して、参加者の皆さんには、「作りたいものを作ることは楽しい」ということと、「たとえ高い技術を持っていなくても、自分の作品を共有することは貴重な学習体験につながる」という2つの重要なメッセージを持ち帰っていただければと思います。",
    "description_ja": "おいしい食事は私たちの生活に喜びと活力を与えてくれる。しかし、食欲をそそる料理を提供する近隣のレストランを見つけるのは、時に少し難しいものです。このセッションでは、MapLibreのパワーを活用し、美味しいお店を見つけるプロセスを簡素化し、強化する方法を探ります。MapLibreが好きな方、モジュール開発に興味がある方、単に美味しいものが好きな方、このセッションはあなたのためのものです。この美味しい旅に参加してみませんか？"
  },
  {
    "title": "Open spatial data in Thailand Higher Education Context - Classroom to Daily Life",
    "date": "2024-12-17",
    "time_range": "11:00-11:15",
    "location": "Auditorium Hall 1",
    "abstract": "Open spatial data plays a transformative role in the landscape of higher education in Thailand, bridging the gap between theoretical learning and practical application in daily life. This keynote address will explore how open spatial data is being integrated into the higher education curriculum, emphasizing its significance in enhancing students' understanding of geography, urban planning, environmental management, and related disciplines.",
    "description": null,
    "speaker": "Chomchanok Arunplod",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/W7J3LW/",
    "abstract_ja": "オープンな空間データは、理論的な学習と日常生活における実践的な応用とのギャップを埋めることで、タイの高等教育の状況において変革的な役割を果たしている。この基調講演では、オープンな空間データが高等教育のカリキュラムにどのように組み込まれているかを探り、地理学、都市計画、環境管理、および関連分野の学生の理解を深める上での重要性を強調する。"
  },
  {
    "title": "Designing user experience and user interface for effective map applications.",
    "date": "2024-12-17",
    "time_range": "11:00-11:15",
    "location": "Room34-1104",
    "abstract": "Geographic information technology has become an important part of our daily lives, leading to the development of various map applications. The design of these applications requires special attention, particularly in terms of User Experience (UX) and User Interface (UI) design. Effective UX/UI design significantly impacts user satisfaction and ease of use, contributing to the overall efficiency and modernity of map applications. By understanding user needs through User Research and Usability Testing, we can establish principles and guidelines for creative design that enhance usability and ensure consistency between data presentation and user interaction.",
    "description": "This session will present about summary of user experience and user interface for map applications. It's suitable for designers, developers, and anyone interested in geographic information technology, especially those involved in developing map applications. It will provide design guidelines that can be applied to various projects, effectively meeting the diverse needs of future users.",
    "speaker": "jirayut Narksin",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/FX9YYW/",
    "abstract_ja": "地理情報技術は私たちの日常生活において重要な位置を占めるようになり、様々な地図アプリケーションが開発されるようになりました。これらのアプリケーションのデザインには、特にユーザーエクスペリエンス（UX）とユーザーインターフェース（UI）のデザインに注意が必要です。効果的なUX/UIデザインは、ユーザーの満足度と使いやすさに大きく影響し、地図アプリケーションの全体的な効率性と現代性に貢献します。ユーザーリサーチとユーザビリティテストを通じてユーザーのニーズを理解することで、ユーザビリティを向上させ、データ表示とユーザーインタラクションの一貫性を確保するクリエイティブデザインの原則とガイドラインを確立することができます。",
    "description_ja": "このセッションでは、地図アプリケーションのユーザーエクスペリエンスとユーザーインターフェースの概要について発表します。デザイナー、開発者、地理情報技術に興味のある方、特に地図アプリケーションの開発に携わっている方に適しています。様々なプロジェクトに適用できるデザインガイドラインを提供し、将来のユーザーの多様なニーズに効果的に応えます。"
  },
  {
    "title": "Camera-LiDAR Fusion for multimodal 3D Object detection in Autonomous Vehicles",
    "date": "2024-12-17",
    "time_range": "11:15-11:30",
    "location": "Auditorium Hall 1",
    "abstract": "The rapid development of autonomous vehicles (AVs) demands strong perception systems capable of reliably recognizing and classifying objects in complicated urban environments. To improve the reliability and precision of 3D object identification, combining camera and LiDAR sensors has emerged as a potential solution. This research describes a multimodal fusion framework that uses camera pictures and LiDAR point clouds to accomplish high-performance 3D object recognition in urban circumstances. Camera sensors provide precise color and texture information necessary for identifying traffic signs, pedestrians, and cars, whereas LiDAR provides exact depth measurements required for interpreting object geometry and spatial relationships. The indicated fusion technique improves detection accuracy by using these sensors' enhancing strengths, especially in difficult settings such as occlusions and fluctuating illumination conditions taking the KITTI open dataset. Here the OpenPCDet is used for 3D object detection and MMDetection for 2D detection as open library. Beside this the Facebook AI Research, Detectron2 flexible framework for 2D and 3D object detection tasks is more popular too.",
    "description": null,
    "speaker": "Badri Raj Lamichhane",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/UNZN7S/",
    "abstract_ja": "自律走行車（AV）の急速な発展には、複雑な都市環境において物体を確実に認識・分類できる強力な知覚システムが必要である。3D物体識別の信頼性と精度を向上させるために、カメラとLiDARセンサーを組み合わせることが潜在的なソリューションとして浮上している。この研究では、カメラ画像とLiDAR点群を使用して、都市環境における高性能な3D物体認識を実現するマルチモーダル融合フレームワークについて説明する。カメラセンサは、交通標識、歩行者、車の識別に必要な正確な色とテクスチャ情報を提供し、LiDARは、物体の形状と空間的関係の解釈に必要な正確な深度測定値を提供する。表示されたフュージョン技術は、特にKITTIオープンデータセットのようなオクルージョンや変動する照明条件のような困難な設定において、これらのセンサーの強化された強みを使用することにより、検出精度を向上させます。ここでは、オープンライブラリとして、3次元物体検出にOpenPCDet、2次元検出にMMDetectionを使用している。また、Facebook AI ResearchのDetectron2は、2Dと3Dの物体検出タスクのための柔軟なフレームワークです。"
  },
  {
    "title": "USING FOSS4G TOOLS WITH RDNDVI TECHNIQUES TO ANALYZE FLOOD HAZARD IN TROPICAL SE ASIA AREA AT WANG THONG RIVER BASIN, PHITSANULOKE, THAILAND.",
    "date": "2024-12-17",
    "time_range": "11:15-11:30",
    "location": "Room34-1104",
    "abstract": "This study aims to find the results of using a free disaster mapping application developed on Google Earth, named “Hazmapper”. This tool allows users to create maps and GIS products from Sentinel or Landsat datasets without the high time and cost usually needed for traditional analysis.",
    "description": "Key words: NDVI, rdNDVI, MAE, Flood hazard, Watershed management, Repeatable analysis, Hydrologic relationships.",
    "speaker": "Kittituch Naksri | Chaiwiwat Vansarochana",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/THZSUG/",
    "abstract_ja": "本研究の目的は、Google Earth上で開発された無料の災害地図作成アプリケーション \"Hazmapper \"を使用した結果を明らかにすることである。このツールにより、ユーザーはセンチネルやランドサットのデータセットから地図やGIS製品を作成することができる。",
    "description_ja": "キーワードNDVI、rdNDVI、MAE、洪水ハザード、流域管理、繰り返し解析、水文関係。"
  },
  {
    "title": "Building an Analysis-Ready Cloud Optimized Global Lidar Data (GEDI and ICESat-2) for Earth System Science applications",
    "date": "2024-12-17",
    "time_range": "11:15-11:30",
    "location": "Auditorium Hall 2",
    "abstract": "Global Ecosystem Dynamics Investigation (GEDI) and Ice, Cloud, and Land Elevation Satellite 2 (ICESat-2) are earth observation missions from NASA to construct a three-dimensional model of earth surface in space and time empowered by Light Detection and Ranging (LIDAR). GEDI and ICESat-2 data are organized by orbit ID, sub-orbit granule and track, and distributed in HDF5 format, which is optimized for big data storage. However, this approach is inconvenient for extracting spatio-temporal areas of interest, because each file stores a track crossing a huge range of latitude and longitude, while lacking a spatial index.",
    "description": "The topic covers the canopy and terrain modeling. The data are widely used to model canopy height and terrain surface. For example, some papers about flooding scenarios of coastal cities are beneficial from these dataset [1][2][3].",
    "speaker": "Yu-Feng Ho",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/3U9UAM/",
    "abstract_ja": "Global Ecosystem Dynamics Investigation (GEDI)とIce, Cloud, and Land Elevation Satellite 2 (ICESat-2)は、Light Detection and Ranging (LIDAR)を用いて、時空間における地表の3次元モデルを構築するNASAの地球観測ミッションです。GEDIとICESat-2のデータは、軌道ID、サブオービットグラニュール、トラックごとに整理され、ビッグデータの保存に最適化されたHDF5フォーマットで配布されている。しかし、この方法は、時空間的な関心領域を抽出するには不都合である。というのも、各ファイルは、空間的なインデックスを欠いたまま、緯度と経度の膨大な範囲を横断するトラックを保存しているからである。",
    "description_ja": "このトピックでは、キャノピーと地形のモデリングを取り上げる。これらのデータは、樹冠の高さや地形表面のモデリングに広く利用されている。例えば、沿岸都市の洪水シナリオに関するいくつかの論文は、これらのデータセットから有益な情報を得ている[1][2][3]。"
  },
  {
    "title": "Advancing Hydrometeorological Data in Asia for Enhanced Water Resources and Climate Applications",
    "date": "2024-12-17",
    "time_range": "11:30-11:45",
    "location": "Auditorium Hall 1",
    "abstract": "Hydrometeorological data are crucial for effective water resource management, weather forecasting, and climate adaptation. In Asia, a region known for its vast geographic diversity and varied climatic conditions, the lack of high-resolution data has been a significant challenge for addressing local-scale issues. Traditional datasets often have coarse spatial resolution (e.g., 10 – 25 km), limiting their usefulness for detailed, localized analysis. To address this gap, we have developed a pioneering dataset offering 1 km resolution hydrometeorological data for the entire Asian continent. This dataset includes essential variables such as precipitation, surface temperature, radiation, soil moisture, evapotranspiration, groundwater, and surface runoff delivering unprecedented detail and accuracy compared to existing coarse-resolution data. The dataset was created using advanced remote sensing techniques, land surface physics, and sophisticated data assimilation methods, ensuring both enhanced spatial resolution and accurate reflection of local conditions. Our dataset spans from 1940 to the present, providing a comprehensive historical archive and seasonal forecasts extending up to six months into the future. This combination of historical and predictive data makes it an invaluable resource for a variety of applications, including water resources, climate studies, agriculture, and disaster assessment. To validate the accuracy of our high-resolution data, we conducted extensive comparisons with satellite remote sensing products such as MODIS (Moderate Resolution Imaging Spectroradiometer), GRACE (Gravity Recovery and Climate Experiment), and SMAP (Soil Moisture Active Passive). These comparisons confirm that our dataset offers superior accuracy and finer detail compared to publicly available data.",
    "description": null,
    "speaker": "Natthachet Tangdamrongsub",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/SWHW7J/",
    "abstract_ja": "水文気象データは、効果的な水資源管理、気象予測、気候適応に不可欠である。広大な地理的多様性と多様な気候条件で知られるアジアでは、高解像度のデータがないことが、地域スケールの問題に取り組む上での大きな課題となっている。従来のデータセットは空間解像度が粗いことが多く（例えば10～25km）、詳細で局所的な分析には限界があった。このギャップに対処するため、我々はアジア大陸全体の1km解像度の水文気象データを提供する先駆的なデータセットを開発した。このデータセットには、降水量、地表面温度、日射量、土壌水分、蒸発散量、地下水、地表流出量などの重要な変数が含まれており、既存の粗解像度データと比較して、これまでにない詳細さと精度を実現している。このデータセットは、高度なリモートセンシング技術、地表面物理学、洗練されたデータ同化手法を用いて作成され、空間解像度の向上と現地の状況の正確な反映を実現している。このデータセットは1940年から現在までのもので、包括的な過去のアーカイブと、6ヶ月先までの季節予報を提供する。このような歴史的データと予測データの組み合わせは、水資源、気候研究、農業、災害評価など、さまざまな用途に利用できる貴重なリソースです。私たちの高解像度データの精度を検証するために、MODIS（中分解能画像分光放射計）、GRACE（重力復元気候実験）、SMAP（土壌水分アクティブパッシブ）などの衛星リモートセンシング製品との広範な比較を行いました。これらの比較により、我々のデータセットが、一般に入手可能なデータと比較して、優れた精度とより詳細な情報を提供することが確認された。"
  },
  {
    "title": "Social Media Data analysis in a Restaurant Context : A Case Study of TikTok",
    "date": "2024-12-17",
    "time_range": "11:30-11:45",
    "location": "Auditorium Hall 2",
    "abstract": "This study explores the integration of Natural Language Processing (NLP) and Geographic Information Systems (GIS) to analyze the spatial distribution and sentiment of restaurants based on TikTok data. Data was collected from TikTok using primary and secondary hashtags related to restaurant reviews in Bangkok. The resulting database enabled a detailed analysis of restaurant locations and customer sentiment using Logistic Regression for sentiment analysis. The findings indicate that negative reviews were predicted with the highest accuracy (84%), followed by positive (78%) and neutral (76%) reviews. The spatial analysis identified a dense of restaurants in the inner districts of Bangkok. This integration of NLP and GIS not only mapped the popularity of restaurants as mentioned on TikTok but also provided significant insights into consumer behavior and preferences. The study demonstrates the effectiveness of combining NLP and GIS for geospatial analysis, offering a powerful tool for understanding social media trends and their impact on local businesses. The results underscore the potential for leveraging social media data to inform urban planning and business strategies, particularly in the context of food and hospitality industries.",
    "description": null,
    "speaker": "Asamaporn Sitthi",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/TLBAPD/",
    "abstract_ja": "本研究では、自然言語処理（NLP）と地理情報システム（GIS）の統合を模索し、TikTokのデータに基づいてレストランの空間分布とセンチメントを分析する。データは、バンコクのレストランのレビューに関連する一次および二次ハッシュタグを使用してTikTokから収集された。得られたデータベースは、センチメント分析のためのロジスティック回帰を使用して、レストランの場所と顧客のセンチメントの詳細な分析を可能にした。その結果、否定的なレビューが最も高い精度（84％）で予測され、肯定的なレビュー（78％）、中立的なレビュー（76％）がそれに続いた。空間分析では、バンコク都心部に密集するレストランが特定された。このNLPとGISの統合は、TikTokで言及されたレストランの人気をマッピングするだけでなく、消費者の行動や嗜好に関する重要な洞察を提供した。この研究は、地理空間分析のためにNLPとGISを組み合わせることの有効性を実証し、ソーシャルメディアのトレンドとローカルビジネスへの影響を理解するための強力なツールを提供する。この結果は、ソーシャルメディアデータを都市計画やビジネス戦略に活用する可能性を強調するものであり、特に食品・ホスピタリティ産業の文脈において重要である。"
  },
  {
    "title": "Land Use Land Cover Classification Automation Development using Free and Open-Source Software",
    "date": "2024-12-17",
    "time_range": "11:30-11:45",
    "location": "Room34-1104",
    "abstract": "It is crucial for enhancing the efficiency and accessibility of land use and land cover monitoring, supporting informed decision-making in urban planning, environmental management, and sustainable development across diverse geographical contexts. This aims to streamline the process of satellite data acquisition, preprocessing, and seasonal LULC classification through the integration of artificial intelligence (AI) models.",
    "description": null,
    "speaker": "Thantham Khamyai",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/97UWEY/",
    "abstract_ja": "これは、土地利用と土地被覆のモニタリングの効率性とアクセシビリティを高め、多様な地理的背景にわたる都市計画、環境管理、持続可能な開発において、情報に基づいた意思決定を支援するために極めて重要である。これは、人工知能（AI）モデルの統合を通じて、衛星データの取得、前処理、季節的なLULC分類のプロセスを合理化することを目的としている。"
  },
  {
    "title": "New Way Using H3 to Manage GIS Data",
    "date": "2024-12-17",
    "time_range": "11:45-12:00",
    "location": "Room34-1104",
    "abstract": "Managing Geographic Information Systems (GIS) data with H3 (H3Geo) is an efficient and modern method for handling and analyzing geographic data. H3 uses a hexagonal grid system that offers special features, allowing data to be stored at resolution levels from 0 to 14, which helps in dividing and storing data effectively.",
    "description": "H3 is a hexagonal hierarchical spatial indexing system developed by Uber. Instead of using squares (H2), H3 uses hexagons to divide areas on a map. This has several advantages, such as more accurate distance and area calculations and simplifying the processing of GIS data.",
    "speaker": "Tanaporn Songprayad",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/YMYRND/",
    "abstract_ja": "H3(H3Geo)による地理情報システム(GIS)データの管理は、地理データを扱い分析するための効率的で近代的な方法です。H3は、特別な機能を提供する六角形のグリッドシステムを使用しており、0から14までの解像度レベルでデータを保存することができ、データを効果的に分割して保存するのに役立ちます。",
    "description_ja": "H3は、ウーバーが開発した六角形の階層型空間インデックスシステムである。正方形（H2）を使う代わりに、H3では六角形を使って地図上のエリアを分割する。これには、より正確な距離と面積の計算、GISデータの処理の簡素化など、いくつかの利点がある。"
  },
  {
    "title": "How a FOSS4G-Born Business Grew in Japan: The Journey of MIERUNE",
    "date": "2024-12-17",
    "time_range": "11:45-12:00",
    "location": "Auditorium Hall 1",
    "abstract": "When considering the sustainability of open source as a future digital public good, the cycle of success and contribution in the business sector becomes crucial.",
    "description": "Overview",
    "speaker": "Yasuto FURUKAWA",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/R3VX9M/",
    "abstract_ja": "将来のデジタル公共財としてのオープンソースの持続可能性を考えるとき、ビジネス・セクターにおける成功と貢献のサイクルが極めて重要になる。",
    "description_ja": "概要"
  },
  {
    "title": "Celebrating 20 Years of FOSS4G : The Journey of FOSS4G in Thailand",
    "date": "2024-12-17",
    "time_range": "13:00-13:15",
    "location": "Auditorium Hall 1",
    "abstract": "TBA",
    "description": "TBA",
    "speaker": "Sarawut ninsawat",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/LTCJFE/",
    "abstract_ja": "未定",
    "description_ja": "未定"
  },
  {
    "title": "Down the FOSS4G-Asia Memory Lane",
    "date": "2024-12-17",
    "time_range": "13:15-13:30",
    "location": "Auditorium Hall 1",
    "abstract": "first ventured into the world of open-source GIS in 2003. Back then, the landscape was much different—GRASS GIS and MapServer were known names, but familiar tools like QGIS and PostGIS were still in their infancy, with limited functionality and a small user base.",
    "description": null,
    "speaker": "Toru MORI",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/B3ULCK/",
    "abstract_ja": "がオープンソースGISの世界に足を踏み入れたのは2003年のことだった。当時は、GRASS GISやMapServerはよく知られていたが、QGISやPostGISのような馴染みのあるツールはまだ発展途上で、機能も限られており、ユーザーベースも小さかった。"
  },
  {
    "title": "Celebrating four decades of innovation: The GRASS GIS Project",
    "date": "2024-12-17",
    "time_range": "13:30-14:00",
    "location": "Auditorium Hall 1",
    "abstract": "The GRASS GIS project, a pioneering open-source geographic information system, celebrated its 40th anniversary in 2023. As one of the long-standing contributors, I am honored to reflect on the remarkable journey of this leading open-source geospatial software and community. Over the past four decades, GRASS GIS has grown from a modest project initiated by the U.S. Army Corps of Engineers to a robust, globally recognized platform for geospatial analysis and modeling. This evolution is a testament to the dedication and collaborative spirit of the GRASS community, which has continually driven innovation and excellence.",
    "description": null,
    "speaker": "Markus Neteler",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/KYNT8Z/",
    "abstract_ja": "オープンソース地理情報システムのパイオニアであるGRASS GISプロジェクトは、2023年に40周年を迎えました。長年の貢献者の一人として、この代表的なオープンソース地理空間ソフトウェアとコミュニティの目覚ましい歩みを振り返ることができて光栄です。過去40年の間に、GRASS GISは米国陸軍工兵隊によって始められたささやかなプロジェクトから、地理空間分析とモデリングのための堅牢で世界的に認知されたプラットフォームへと成長しました。この進化は、常に革新と卓越を推進してきたGRASSコミュニティの献身と協調精神の証です。"
  },
  {
    "title": "LEVERAGING GEOSPATIAL DATA FOR TRACKING WATER FROM SPACE USING PYTHON PROGRAMMING",
    "date": "2024-12-17",
    "time_range": "14:00-14:30",
    "location": "Auditorium Hall 1",
    "abstract": "Water does not flow according to geographical boundaries but it follows\nelevation. Inland waters from rivers and lakes present crucial natural\nresources playing an indispensable role in the global hydrological cycle.\nStill, their conventional monitoring is constrained by poor spatial\ncoverage. Though satellites help improve coverage, the hydraulic properties\nof rivers often change at a rate faster than the temporal sampling of\nsatellites. Through this talk, two novel web applications are introduced\nfor rivers and lakes built using geospatial datasets and python. While the\nfirst shall seamlessly extract time series of water surface area for\nrivers, lakes and reservoirs from Sentinel-1 VV polarized SAR data. The\nsecond application shall integrate dynamic lake water extents for improving\nlake water surface temperatures, thereby challenging conventional norms.",
    "description": null,
    "speaker": "J. Indu",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/EHLQKJ/",
    "abstract_ja": "水は地理的な境界に従って流れるのではなく、標高に従って流れる。\n標高に従って流れる。河川や湖沼の内水は、地球規模の水循環に不可欠な役割を果たす重要な天然資源である。\n河川や湖沼の内水は、地球規模の水循環において不可欠な役割を果たす重要な天然資源である。\nしかし、従来のモニタリングは、空間的な範囲が狭いという制約があった。\nという制約がある。人工衛星は観測範囲の改善に役立ってはいるが、河川の水理特性はしばしば\n河川の水理特性は、人工衛星の時間サンプリングよりも速い速度で変化することが多い。\nこの講演では、2つの新しいウェブ・アプリケーションを紹介する。本講演では、次の2つの新しいウェブ・アプリケーションを紹介する。\nを紹介する。一方\n最初のアプリケーションは、河川、湖沼、貯水池の水面積の時系列データをシームレスに抽出するものである。\n河川、湖沼、貯水池の水面積の時系列データをSentinel-1 VV偏波SARデータからシームレスに抽出する。2つ目は\n2つ目のアプリケーションは、湖の水面温度を改善するために、動的な湖の水面積を統合する。\n湖の水面温度を改善し、従来の常識を覆す。"
  },
  {
    "title": "POWERING THE FUTURE GRID : INTELLIGENCE TRANSMISSION MONITORING WITH SAR SATELLITE IMAGERY AND LiDAR",
    "date": "2024-12-17",
    "time_range": "15:00-15:30",
    "location": "Auditorium Hall 1",
    "abstract": "Enhancing the efficiency of the Electricity Generating Authority of Thailand (EGAT)’s transmission system through satellite imagery and LiDAR. With over 470 transmission lines spanning 25,000 km, expansion plans aim to provide nationwide coverage. LiDAR is used for aerial mapping to create an accurate initial database, while CCTV systems enable real-time surveillance. Satellite imagery, particularly SAR satellite imagery combined with InSAR and machine learning, ensures precise monitoring of encroachments. Integrated GIS application support right-of-way management, contributing to safe and efficient power distribution.",
    "description": null,
    "speaker": "Kamolratn Chureesampant",
    "url": "https://talks.geoinfo-lab.org/foss4g-asia-2024/talk/ZLEDP3/",
    "abstract_ja": "衛星画像とLiDARによりタイ発電公社（EGAT）の送電システムの効率化を図る。25,000kmに及ぶ470以上の送電線があり、拡張計画では全国をカバーすることを目指している。LiDARは正確な初期データベースを作成するための航空マッピングに使用され、CCTVシステムはリアルタイムの監視を可能にする。衛星画像、特にInSARと機械学習を組み合わせたSAR衛星画像は、侵入の正確な監視を保証する。統合されたGISアプリケーションは、道路管理をサポートし、安全で効率的な配電に貢献します。"
  }
]